define openeyes = ImageDissolve("imagedisolve openeyes.png", 2.0, 8, reverse=True)

label scene7_1:

    scene black
    play music "water-driping.mp3"

    DT "Агов! Ти мене чуєш? Аго-о-ов!"
    "Перше, що ти відчуваєш – пекельний біль у руках та ногах. Він схожий на біль опіків від вогню, з якими стикався чи не кожен житель лісу Сумеру."
    GG "Болить…"
    DT "Подивись на мене."
    DT "Відкрий очі."

    scene bg laboratory night
    show dottore lab
    with openeyes
    play music "in the night.mp3"
    play sound "water-driping.mp3"
    DT "Я вже подумав, що ти помреш."
    "Ти розсіяно дивишся навколо."
    "Ти лежиш на підлозі на якомусь брудному матраці. Здається, до тебе тут вже побувало багато «пацієнтів» Дотторе, адже вся поверхня покрита багряними плямами."
    show dottore lab smile 10
    "Гидота."
    play sound "metal.mp3"
    "Ти сіпаєш рукою і без здивування виявляєш, що тебе знову прив’язали, цього разу – до металевої труби, яка проходить вздовж стіни."
    DT "Пробач, але я не можу дозволити тобі розгулювати по лабораторії. У мене тут багато інструментів, до яких не повинні торкатись інші люди."
    show dottore lab smile 9
    DT "В іншому, я зробив все, що планував. Весь елеазар знято, тож залишається лише наглядати за загоєнням."
    "Ти опускаєш очі і бачиш, що твої ноги обмотані бинтами, які дуже дивно пахнуть."
    "Руки теж в бинтах по лікоть і вже просякли кров’ю та іншими рідинами."
    GG "Хочу пити…"
    show dottore lab smile 4
    DT "Вода в мисці зліва від тебе. Суп там же, але він мабуть вже встиг охолонути. Відро з іншої сторони."
    DT "Я іду відпочивати і тобі раджу."
    show dottore lab smile 6
    DT "Кричати не має сенсу."
    DT "Завтра побачимось і подивимось на перші результати."
    hide dottore lab smile 6
    with dissolve
    play sound "<from 15 to 16>skrep.wav" volume 1 
    play sound "key2.mp3" volume 1 
    "Дотторе встає і, наспівуючи якусь пісеньку, іде з підвалу, не забуваючи замкнути двері на ключ."

    "Ти обережно сідаєш і оглядаєш своє тіло. Вчений вирішив не завдавати собі зайвого клопоту і не надягнув на тебе навіть спідню білизну."

    window hide
    with None
    show half_black 
    show legs
    with dissolve
    pause

    "Страшенно болить. Тобі хочеться здерти з себе бинти, але ти вирішуєш цього не робити. Хто знає, яку коросту можна підхопити на цьому матраці."
    "Світло потрапляє до лабораторії лише крізь невелике віконце під стелею. Навіть якщо тебе не прив’язали б, пролізти у нього не вийшло."

    hide legs 
    hide half_black
    with dissolve

    window auto

    "Ти зітхаєш. Що робити?"

    $ tried_to_escape_counter = 0;

    menu:
        "Поїсти та відпочити":
            $ False
        "Спробувати звільнитись":
            $ tried_to_escape_counter += 1
            "Ти сідаєш зручніше і роздивляєшся кайданки, якими Дотторе прикував тебе до труби. Металева конструкція виглядає міцною та надійною і здається, без ключа їх не відкрити."
            play sound "metal.mp3"
            "Ти намагаєшся висковзнути крізь кільце, що схопило тебе за набряклу кисть, проте нічого не виходить."

    "Ти їси холодний суп, який залишив тобі вчений. Що ж, це краще, ніж нічого."
    "Відставивши тарілку ти вкладаєшся на брудному матраці і провалюєшся у тривожний неглибокий сон."
    show black with fade


    jump scene8_1

