label scene7_2:

    scene bg black with fade


    DT "Агов! Ти мене чуєш? Аго-о-ов!"
    """
    Перше, що ти відчуваєш – пекельний біль у руках та ногах. Він схожий на біль опіків від вогню, з якими стикався чи не кожен житель лісу Сумеру.
    """
    GG "Болить…"
    DT "Подивись на мене."
    DT "Відкрий очі."

    scene bg laboratory
    show dottore
    with Dissolve(4)

    DT "Я вже подумав, що ти помреш."
    """
    Ти розсіяно дивишся навколо.
    
    Ти лежиш на підлозі на якомусь брудному матраці. Здається, до тебе тут вже побувало багато «пацієнтів» Дотторе, адже вся поверхня покрита багряними плямами.
    
    Гидота.
    
    Ти сіпаєш рукою і без здивування виявляєш, що тебе знову прив’язали, цього разу – до металевої труби, яка проходить вздовж стіни.
    """
    DT "Пробач, але я не можу дозволити тобі розгулювати по лабораторії. У мене тут багато інструментів, до яких не повинні торкатись іншу люди."
    DT "Бачу, що процес виведення вже розпочався, тому доведеться трошки потерпіти."
    GG "Хочу пити…"
    DT "Вода в мисці зліва від тебе. Суп там же, але він мабуть вже встиг охолонути. Відро з іншої сторони."
    DT "Я іду відпочивати і тобі раджу."
    DT "Кричати не має сенсу."
    DT "Завтра побачимось і подивимось на перші результати."

    "Дотторе встає і, наспівуючи якусь пісеньку, іде з підвалу, не забуваючи замкнути двері на ключ."

    hide dottore with moveoutright 

    """
    Ти обережно сідаєш і оглядаєш своє тіло. Вчений вирішив не завдавати собі зайвого клопоту і не надягнув на тебе навіть спідню білизну.
    
    Страшенно болить. Таке відчуття, що всі кістки та м’язи повільно занурюють в окроп, паралельно викручуючи їх в різні сторони.
    
    Хочеться видерти всі нутрощі з себе, але ти намагаєшся заспокоїтись і згадати ті часи, коли у тебе підіймалась температура тіла. Тоді тобі теж було настільки погано, що хотілось втопитись у найближчому озері, але вже за кілька днів тобі було соромно за такі свої думки, адже самопочуття покращувалось.
    
    Тому треба просто почекати. Дія препарату закінчиться 
    
    Світло потрапляє до лабораторії лише крізь невелике віконце під стелею. Навіть якщо тебе не прив’язали б, пролізти у нього не вийшло.
    
    Ти зітхаєш. Що робити?
    """

    menu:
        "Поїсти та відпочити": 
            $ dotore_mad -= 10
        "Спробувати звільнитись": 
            $ dotore_mad += 10
            """
            Ти сідаєш зручніше і роздивляєшся кайданки, якими Дотторе прикував тебе до труби. Металева конструкція виглядає міцною та надійною і здається, без ключа їх не відкрити.
            
            Ти намагаєшся висковзнути крізь кільце, що схопило тебе за кисть, проте нічого не виходить.
            """

    """
    Ти їси холодний суп, який залишив тобі вчений. Що ж, це краще, ніж нічого.
    
    Відставивши тарілку ти вкладаєшся на брудному матраці і провалюєшся у тривожний неглибокий сон.
    """

    jump scene8_2