label scene10_1:
    
    scene bg black
    play music "water-driping.mp3"
    """
    …Архонти, як же ж…
    
    …болить…
    """
    GG "…"
    GG "…кх…"
    GG "…води…"
    """
    
    …
    
    …нікого?..
    """
    GG "…хочу пити…"
    """
    …хто-небудь… будь ласка…
    
    …
    
    Голова ніби налита свинцем. Так погано і важко тобі не було навіть у дитинстві, коли тобі довелось пролежати місяць у ліжку з температурою тіла, яку лікарі називають критичною.
    """
    GG "…Дотторе…"

    camera:
        blur 0
        linear 0.5 blur 30
        linear 1.0 blur 20
    
    scene bg laboratory night with dissolve

    """
    Ти відкриваєш очі намагаєшся сфокусувати погляд на дверях навпроти.
    """


    scene bg black with dissolve
    "Треба спробувати ще раз. Вчений завжди лишає тобі їжу та воду поруч із матрацом, коли йде кудись, тож твої зусилля повинні винагородитись."

    camera:
        blur 0
    scene bg laboratory night with dissolve
   

    """
    Так краще.
    
    Вода. Треба знайти воду.
    
    Голова крутиться все менше. Здається, дія того газу поступово починає згасати, повертаючи тобі можливість знову управляти своїм тілом.
    
    Чудово.
    
    Ти обережно повертаєш голову і бачиш каструлю з прозорою рідиною, про яку майже мрієш останні кілька хвилин.
    """


    """
    Треба попити.
    
    Все, до останньої краплі.
    """

    menu:
       
        "Простягнути руку":
            "Ти намагаєшся намацати стакан, який завжди стоїть поруч із матрацом, але його нема."
            "Дотторе його переставив чи що?"
        "Сісти":
            $ False

    "Ти хочеш сісти, щоб зручніше втамувати спрагу, але щось тобі заважає." with vpunch
    GG "Що таке?"

    stop music
    GG "…"

    "Ти переводиш погляд на свої руки."

    play music "<from 0 to 14>horror.mp3"

    scene bg black
    show hands cut
    with dissolve
    pause

    "Точніше, на те, що від них залишилось."

    GG "Ні-ні-ні! Що ти наробив?!"

    camera:
        blur 0
        linear 1.5 blur 30
        linear 3.0 blur 0
    

    GG "Гей! ДОТТОРЕ! Гей!"
    GG "Йди сюди!"
    GG "НІ!"

    menu:
        "Закричати":
            pass

    
    "Ти кричиш так голосно, що колби на поличках цієї клятої лабораторії повинні були тріснути і розбитися." with vpunch
    """
    Це не може бути правдою, ні. Це кошмар, просто реалістичний кошмар, який от-от закінчиться.
    
    Треба прокинутись.
    
    Треба притулитись до чогось холодного, щоб повернути собі жвавість свідомості.
    
    Так, треба…
    
    …піднятись на ноги.
    
    Ти хочеш встати з матраца, але відчуваєш, що щось не так.
    
    …
    """

    menu:
        "Скинути з себе ковдру":
            "Нічого не виходить."
    menu:
        "Скинути з себе ковдру":
            GG "…о ні…" with vpunch

    
    scene bg black
    show legs cut
    with fade


    menu:
        "Закричати":
            play sound screem

    GG "Що ти наробив?!"
    GG "За що?!"
    GG "Ти! Ти чортів маніяк!"
    GG "Ти мене чуєш?!"

    camera:
        blur 0
        linear 1.5 blur 30
        linear 3.0 blur 0

    GG "ДОТТОРЕ!"


    menu:
        "Закричати":
            play sound screem


    scene bg laboratory night with dissolve

    GG "…чому?.."
    GG "…де я знаходжуся?.."
    GG "…д… допоможіть…"
    GG "…мені боляче..."
    GG "…Архонти, я… хто-небудь..."
    GG "ЗАБЕРІТЬ МЕНЕ ЗВІДСИ!"

    camera:
        blur 0
        linear 1.5 blur 30
        linear 3.0 blur 0
        
    """
    Ні, це сон, це лише сон. Звичайний кошмар, заснований на твоїх страхах і переживаннях, що постійно живуть у голові.
    
    Потрібно прокинутись.
    
    Це точно сон, навіяний дивним газом, яким тобі зранку дав подихати вчений.
    
    Потрібно прокинутись.
    
    Потрібно просто як зазичай
    """

    menu:
        "Поїсти та відпочити":
            $ False
        "Спробувати звільнитись":
            $ tried_to_escape_counter += 1
    """
    …потрібно щось робити…
    """
    GG "…допоможіть мені…"
    scene black with dissolve
    GG "ДОТТОРЕ!"
    
    menu:
        "Закричати":
            play sound screem


    jump scene11_1