label scene6_1:

    show dottore lab knife 1


    DT "Ніж? Я щиро здивований. Мало хто любить, коли я тримаю гострі предмети в руках."
    DT "Добре, давай проведемо наступні дні з користю."
    GG "Для чого… потрібен… ніж?"
    "Язик ледь слухається тебе і ти не знаєш напевне, він терпне від ліків чи від страху. Ти сіпаєш руками в надії вислизнути з полону, але шкіряні ремені тримають міцно."
    show dottore lab smile 7
    DT "Скажи, ти любиш рибу?"
    GG "…"
    GG "Що?"
    DT "Рибу. Річкову, з лускою?"
    GG "…"
    GG "Я не розумію."
    DT "Шкода. Я сподівався обмінятись думками."
    show dottore lab smile 4
    DT """Тоді швидка передісторія: у нас в Академії стояв великий резервуар, у якому студенти вирощували різну флору та фауну для досліджень.

    Я іноді приходив до нього і спостерігав за рибками, які плавали у воді.

    Одного вечора я помітив, як дві рибини почали активно метушитись.
    Між ними зав’язалась невелика бійка, в ході якої обидві втратили частину луски на хвостах."""
    
    show dottore lab knife
    DT "І знаєш, що відбулось далі?"

    python:
        renpy.input("", length=32)

    show dottore lab
    DT "…"
    DT "Краще мовчи далі."
    DT "Отож, я продовжив свої спостереження. Через кілька тижнів я зловив ті дві риби і побачив, що луска не відросла."
    DT "Не відросла вона і через півроку."
    show dottore lab smile 6
    DT "Розумієш, до чого я?"
    show dottore lab smile 4
    DT "Елеазар схожий на луску риби, принаймні ззовні."
    DT "Якщо ми його зчистимо, можливо, він більше ніколи не з’явиться на тілі."
    DT "Або з’явиться, але не відразу. Не знаю, але спробувати точно потрібно."
    show dottore lab smile 9
    GG "Це звучить… як повна маячня! В лісах Сумеру… живе ящірка, покрита лускою і… ця луска набагато більше схожа на елеазар."
    GG "Коли ящірка втрачає її… то через кілька днів вона відростає. Моя хвороба і луска… тварин чи риб – це абсолютно різні речі!"
    show dottore lab smile 1
    "Дотторе знизує плечима."


    DT "Не спробуєш – не дізнаєшся, вірно?"
    GG "Завдання лікаря… допомагати, а не калічити!"
    show dottore lab knife 1
    DT "Все вірно. Я допоможу багатьом, якщо знайду правильний метод."
    
    DT "Постарайся не кричати, не люблю голосні звуки."
    "Дотторе бере зручніше ніж у руку і нахиляється до твоїх ніг."
    show dottore lab knife
    DT "Почну з лівої."
    GG "Зупинись!"
    show dottore lab knife 1
    GG "Це ТОЧНО не допоможе!"
    GG "Ти…"

    menu: 
        "Закричати":
            play sound "screem.mp3" volume 0.5
        "Сіпнутись":
            window hide
            with hpunch

    camera:
        blur 0
        linear 0.5 blur 30
        linear 1.0 blur 0
   

    "Дотторе сильніше тисне на лезо і дуже невміло намагається зішкребти нарости."
    show half_black 
    show legs operation
    with dissolve
    "Елеазар майже не піддається."
    "Лусочки погано відділяються від тіла."

    play audio "bones crunching.wav"
    show half_black 
    show legs operation 3
    with dissolve
    "Боляче."

    
    menu: 
        "Закричати":
            play sound "screem.mp3"
        "Сіпнутись":
            window hide
            with hpunch

    DT "Потерпи, котику. Я це роблю не тільки заради тебе, а й заради всіх хворих."
    GG "…"
    "Здається, тканина під твоїми ногами намокла. Ти не знаєш напевно, від крові чи холодного поту, який вкриває твою шкіру, але сил перевірити ти не маєш."
    DT "Ось так, ось так."

    camera:
        blur 0
        linear 0.5 blur 30
        linear 1.0 blur 0

    "Ніж шкребе по оголеній закривавленій шкірі, чіпляється за елеазар і знову ковзає по здертих ділянках."

    menu:
        "Покликати вченого по імені":
            $ False
        "Попросити зупинитись":
            $ False

    show dottore lab tweezers
    with dissolve

    DT "Ще трохи."
    show operation tweezers
    with dissolve
    "Дотторе бере пінцет і вириває окремі лусочки, які дуже глибоко вросли у твоє тіло."
    show operation tweezers 2
    with dissolve
    DT "І-і-і остання. Все, ліва нога чиста. Ти молодець."

    hide operation tweezers 2
    with dissolve

    "Вчений бере зі столу пляшечку з темного скла і виливає на закривавлену ногу рідину з різким запахом."

    camera:
        blur 0
        linear 0.5 blur 30
        linear 1.0 blur 0

    menu:
        "Закричати":
            play sound "screem.mp3" volume 2

    "Здається, що на тебе вилили окріп. Хочеться втратити свідомість, але вона більш твереза, ніж у будь-який інший день."

    scene bg laboratory
    show dottore lab tweezers
    with dissolve

    DT "Таким темпом встигнемо зчистити все до обіду. До речі, що тобі приготувати?"
    "Ти відкриваєш рот, але не можеш видушити з себе ні звуку."
    show dottore lab smile 7
    DT "Що таке? Зірвався голос? Буває. Казав же, не треба кричати."
    "Вчений обходить кушетку і стає з протилежної сторони."

    DT "Продовжуємо?"
    GG "…"

    show dottore smile 3
    DT "Продовжуємо."


    play audio "bones crunching.wav"
    play sound "screem.mp3"

    image black = Color((0, 0, 0, 255))
    scene black with Dissolve(0.5)

    jump scene7_1