label scene6_1:

    show dottore knife


    DT "Ніж? Я щиро здивований. Мало хто любить, коли я тримаю гострі предмети в руках."
    DT "Добре, давай проведемо наступні дні з користю."
    GG "Для чого… потрібен… ніж?"
    "Язик ледь слухається тебе і ти не знаєш напевне, він терпне від ліків чи від страху. Ти сіпаєш руками в надії вислизнути з полону, але шкіряні ремені тримають міцно."
    DT "Скажи, ти любиш рибу?"
    GG "…"
    GG "Що?"
    DT "Рибу. Річкову, з лускою?"
    GG "…"
    GG "Я не розумію."
    DT "Шкода. Я сподівався обмінятись думками."

    DT """Тоді швидка передісторія: у нас в Академії стояв великий резервуар, у якому студенти вирощували різну флору та фауну для досліджень.
    Я іноді приходив до нього і спостерігав за рибками, які плавали у воді.
    Одного вечора я помітив, як дві рибини почали активно метушитись.
    Між ними зав’язалась невелика бійка, в ході якої обидві втратили частину луски на хвостах."""
    
    
    DT "І знаєш, що відбулось далі?"

    python:
        renpy.input("", length=32)



    "TODO !!! dotore_mad: [dotore_mad]"
    "DEBUGG !!! dotore_mad: [dotore_mad]"
    "DEBUGG !!! dotore_mad: [dotore_mad]"
    "DEBUGG !!! dotore_mad: [dotore_mad]"