label scene6_2:


    show dottore

    DT "Втім, ніхто з попередніх пацієнтів не обирав ні голки, ні ножі, ні пилки. Всі чомусь вважать, що рідини менш… небезпечні та болючі."
    GG "…"
    GG "Що у пробірці?"
    DT "Радий, що тобі цікаво"
    DT "Це моя власна розробка. Я довго досліджував елеазар і дійшов висновку, що кожна лусочка містить у собі 90%% кальцію."
    DT "Кальцій це такий елемент, з якого складаються наші кістки, зуби та деякі інші тверді частини нашого тіла. Саме тому елеазар такий міцний і при розростанні не дозволяє суглобам нормально рухатись."
    DT "Отож я подумав, що якщо вивести кальцій з організму, то елеазар має зникнути сам собою. Ну знаєш, як зникають прищі з обличчя, якщо перестати їсти солодке."
    GG "…"
    GG "Це не зовсім так працює."
    DT "Можливо я не майстер аналогій, проте деякі речі мені краще знати."
    DT "Тому я введу тобі цю речовину в організм і ми подивимось, як поведе себе захворювання."

    menu:
        "Чи не стануть кістки крихкими?":
            $ False
        "Це боляче?":
            $ False

    DT "Побачимо. В будь-якому випадку, я цей препарат ще ні на кому не тестував."
    DT "Але впевнений, що все вийде. Не бачу жодної причини, чому б не мало вийти."
    GG "Скільки часу це займе?"
    DT "Кілька днів. Припускаю, через тиждень ми побачимо результат."

    "Ти сумніваєшся у методі, який тобі, ну нехай буде, пропонує Дотторе"

    DT "Давай починати."

    menu:
        "Прибрав руки від мене!":
            $ dotore_mad += 10
        "Промовчати":
            $ dotore_mad -=10 


    "TODO !!! dotore_mad: [dotore_mad]"
    "DEBUGG !!! dotore_mad: [dotore_mad]"
    "DEBUGG !!! dotore_mad: [dotore_mad]"
    "DEBUGG !!! dotore_mad: [dotore_mad]"