# TODO: Translation updated at 2023-11-05 14:44

# game/script.rpy:21
translate english start_f31de329:

    # "Я почуваюсь [mood!t]."
    "I feels [mood!t]."

# game/script.rpy:32
translate english start_d4371f02:

    # "PAUSE FOR DEBUG"
    "PAUSE FOR DEBUG"

# game/script.rpy:40
translate english scene1_0efa41ce:

    # "Ти полегшено зітхаєш і пришвидшуєш крок."
    "Ти полегшено зітхаєш і пришвидшуєш крок."

# game/script.rpy:40
translate english scene1_415a8571:

    # "Ну нарешті!{w} Кілька тижнів снів під відкритим небом у компанії хмари комарів, десятки кілометрів не найбезпечнішими ділянками лісу, харчування самими лише ягодами та засушеним м’ясом, і ось ти тут – у місті Сумеру!"
    "Ну нарешті!{w} Кілька тижнів снів під відкритим небом у компанії хмари комарів, десятки кілометрів не найбезпечнішими ділянками лісу, харчування самими лише ягодами та засушеним м’ясом, і ось ти тут – у місті Сумеру!"

# game/script.rpy:40
translate english scene1_39255364:

    # "Аж не віриться. Ти щипаєш себе за руку і, зойкнувши, розумієш, що все навколо реальне."
    "Аж не віриться. Ти щипаєш себе за руку і, зойкнувши, розумієш, що все навколо реальне."

# game/script.rpy:40
translate english scene1_01fcbf38:

    # "Що ж, чудово! Залишилось найпростіше: потрапити у місто, повечеряти та знайти Академію."
    "Що ж, чудово! Залишилось найпростіше: потрапити у місто, повечеряти та знайти Академію."

# game/script.rpy:40
translate english scene1_aa026cd0:

    # "А ось і вхід."
    "А ось і вхід."

# game/script.rpy:53
translate english scene1_d9ddcf95:

    # O "Вітаю! Прошу назвати ваше ім’я та ціль прибуття у місто"
    O "Вітаю! Прошу назвати ваше ім’я та ціль прибуття у місто"

# game/script.rpy:63
translate english scene1_d9cbbdce:

    # O "Зрозуміло, [GG]. Спитайте детальніше про це у трактирі, туди стікаються всі новини"
    O "Зрозуміло, [GG]. Спитайте детальніше про це у трактирі, туди стікаються всі новини"

# game/script.rpy:65
translate english scene1_d9cbbdce_1:

    # O "Зрозуміло, [GG]. Спитайте детальніше про це у трактирі, туди стікаються всі новини"
    O "Зрозуміло, [GG]. Спитайте детальніше про це у трактирі, туди стікаються всі новини"

# game/script.rpy:67
translate english scene1_d9cbbdce_2:

    # O "Зрозуміло, [GG]. Спитайте детальніше про це у трактирі, туди стікаються всі новини"
    O "Зрозуміло, [GG]. Спитайте детальніше про це у трактирі, туди стікаються всі новини"

# game/script.rpy:69
translate english scene1_9e118c73:

    # O "Також маю повідомити, що останнім часом почастішали звернення від родичів мандрівників про щезнення людей."
    O "Також маю повідомити, що останнім часом почастішали звернення від родичів мандрівників про щезнення людей."

# game/script.rpy:69
translate english scene1_814aba85:

    # O "Тож якщо випили – ідіть відразу у номер готелю, а не бігайте по незнайомим вуличкам у пошуках пригод."
    O "Тож якщо випили – ідіть відразу у номер готелю, а не бігайте по незнайомим вуличкам у пошуках пригод."

# game/script.rpy:69
translate english scene1_bcb3049d:

    # O "Та я впевнений, ніякої проблеми немає."
    O "Та я впевнений, ніякої проблеми немає."

# game/script.rpy:77
translate english scene1_f43b12ff:

    # GG "..."
    GG "..."

# game/script.rpy:79
translate english scene1_52e8f911:

    # O "Сумеру – дуже безпечне місто, а ті мандрівники продовжили шлях і зникли десь у незнайомих для них лісах."
    O "Сумеру – дуже безпечне місто, а ті мандрівники продовжили шлях і зникли десь у незнайомих для них лісах."

# game/script.rpy:79
translate english scene1_00f50168:

    # O "Не турбуйтесь!"
    O "Не турбуйтесь!"

# game/script.rpy:79
translate english scene1_6cd4f09f:

    # O "Гарного вам перебування!"
    O "Гарного вам перебування!"

# game/script.rpy:87
translate english scene1_5755e432:

    # GG "Дякую!"
    GG "Дякую!"

# game/script.rpy:96
translate english scene2_1f64e317:

    # "Ти ідеш по місту роззираючись навколо. Сонце в зеніті і добряче потилицю, тому ти вирішуєш накинути капюшон, щоб сховатись від нього"
    "Ти ідеш по місту роззираючись навколо. Сонце в зеніті і добряче потилицю, тому ти вирішуєш накинути капюшон, щоб сховатись від нього"

# game/script.rpy:100
translate english scene2_89c85a87:

    # "Ти потрапляєш на вуличку, на якій розташувалась велика кількість крамничок з фруктами, овочами, місцевим одягом та сувенірами. Навколо них скупчилось багато туристів, тому ти ідеш далі, щоб не штовхатись у натовпі."
    "Ти потрапляєш на вуличку, на якій розташувалась велика кількість крамничок з фруктами, овочами, місцевим одягом та сувенірами. Навколо них скупчилось багато туристів, тому ти ідеш далі, щоб не штовхатись у натовпі."

# game/script.rpy:104
translate english scene2_d5e16c3f:

    # "Біля дороги росте дуже багато дерев та рослин, більшість з яких тобі не знайомі. Ти з цікавістю нахиляєшся, щоб понюхати незвичайну красиву квітку з прозорими пелюстками і зі здивуванням виявляєш, що та реагує на твоє наближення нервовим поворотом стебла. Тобі стає не по собі через відчуття, ніби вона за тобою стежить, тому ти вирішуєш не чіпати її та йдеш собі геть"
    "Біля дороги росте дуже багато дерев та рослин, більшість з яких тобі не знайомі. Ти з цікавістю нахиляєшся, щоб понюхати незвичайну красиву квітку з прозорими пелюстками і зі здивуванням виявляєш, що та реагує на твоє наближення нервовим поворотом стебла. Тобі стає не по собі через відчуття, ніби вона за тобою стежить, тому ти вирішуєш не чіпати її та йдеш собі геть"

# game/script.rpy:108
translate english scene2_16f9033f:

    # "Повз тебе іноді проходять люди в однаковому зеленому одязі і ти робиш висновок, що це студенти Академії, в яку обов’язково потрібно потрапити до настання сутінок. Можливо, тобі навіть дозволять оселитись у студентських кімнатах, що було би дуже доречно, так як на свою подорож ти витрачаєш майже всі власні кошти."
    "Повз тебе іноді проходять люди в однаковому зеленому одязі і ти робиш висновок, що це студенти Академії, в яку обов’язково потрібно потрапити до настання сутінок. Можливо, тобі навіть дозволять оселитись у студентських кімнатах, що було би дуже доречно, так як на свою подорож ти витрачаєш майже всі власні кошти."

# game/script.rpy:113
translate english scene2_b23710c1:

    # "Ти повільно доходиш до кварталу, де працюють гончарі, ковалі, пекарі та навіть кілька випускників Академії, які, здається, щось розповідають про зірки та астрономію всім охочим послухати. Тут дуже шумно і тісно від людей, діти грають у квача та хованки."
    "Ти повільно доходиш до кварталу, де працюють гончарі, ковалі, пекарі та навіть кілька випускників Академії, які, здається, щось розповідають про зірки та астрономію всім охочим послухати. Тут дуже шумно і тісно від людей, діти грають у квача та хованки."

# game/script.rpy:113
translate english scene2_ac7f4ebd:

    # "Тобі постійно доводиться підійматись угору, що швидко виснажує і так стомлене тіло, від постійного крику починає боліти голова, а запах свіжого хліба нагадує, що настав час поїсти. Тому ти без вагань запитуєш у перехожого, де знаходиться трактир."
    "Тобі постійно доводиться підійматись угору, що швидко виснажує і так стомлене тіло, від постійного крику починає боліти голова, а запах свіжого хліба нагадує, що настав час поїсти. Тому ти без вагань запитуєш у перехожого, де знаходиться трактир."

# game/script.rpy:125
translate english scene3_0f18ca42:

    # T "Вітаю! Займайте будь-який вільний стіл, більшість відвідувачів вже пообідали, тому місця вистачає."
    T "Вітаю! Займайте будь-який вільний стіл, більшість відвідувачів вже пообідали, тому місця вистачає."

# game/script.rpy:129
translate english scene3_e4e5db91:

    # T "За п’ять хвилим подам."
    T "За п’ять хвилим подам."

# game/script.rpy:133
translate english scene3_4bc7566b:

    # T "Очікуйте."
    T "Очікуйте."

# game/script.rpy:138
translate english scene3_cc66e8a0:

    # "Ти сідаєш за стіл на двох, який знаходиться на другому поверсі таверни, подалі від чужих очей та розмов."
    "Ти сідаєш за стіл на двох, який знаходиться на другому поверсі таверни, подалі від чужих очей та розмов."

# game/script.rpy:138
translate english scene3_ddd476bf:

    # "Дійсно, за кілька хвилин тобі приносять (назва обраної страви) та (назва обраного напою). Ти з радістю відмічаєш, що незнайома страва дуже смачна, тому ти замовляєш ще одну порцію, якою можна повільно насолоджуватись найближчу годину."
    "Дійсно, за кілька хвилин тобі приносять (назва обраної страви) та (назва обраного напою). Ти з радістю відмічаєш, що незнайома страва дуже смачна, тому ти замовляєш ще одну порцію, якою можна повільно насолоджуватись найближчу годину."

# game/script.rpy:138
translate english scene3_ccd745d2:

    # "Так як ніхто не бачить тебе, ти обережно підіймаєш рукав плаща та розглядаєш тверді лусочки, які знову з’явились під час загострення хвороби"
    "Так як ніхто не бачить тебе, ти обережно підіймаєш рукав плаща та розглядаєш тверді лусочки, які знову з’явились під час загострення хвороби"

# game/script.rpy:150
translate english scene3_b1fc48b2:

    # "Пальці погано гнуться та тремтять, а рани під лусочками – болять так сильно, що хочеться плакати. Ти приречено чухаєш в одну нігтем і розчаровано розумієш, що нарости стали більш твердими у порівнянні з тими, якими ти їх запам’ятала перед початком своєї подорожі."
    "Пальці погано гнуться та тремтять, а рани під лусочками – болять так сильно, що хочеться плакати. Ти приречено чухаєш в одну нігтем і розчаровано розумієш, що нарости стали більш твердими у порівнянні з тими, якими ти їх запам’ятала перед початком своєї подорожі."

# game/script.rpy:150
translate english scene3_0da79fa9:

    # "Одна надія на те, що вчені з Академії дійсно знайшли ліки від цієї хвороби. Ти сподіваєшся, що лікування не займе багато часу, адже вдома тебе з нетерпінням чекає мама та маленький брат, якого потрібно щодня доглядати."
    "Одна надія на те, що вчені з Академії дійсно знайшли ліки від цієї хвороби. Ти сподіваєшся, що лікування не займе багато часу, адже вдома тебе з нетерпінням чекає мама та маленький брат, якого потрібно щодня доглядати."

# game/script.rpy:150
translate english scene3_4b06ec22:

    # "Елеазар став для тебе справжнім покаранням."
    "Елеазар став для тебе справжнім покаранням."

# game/script.rpy:150
translate english scene3_54d85973:

    # "Ти більше не можеш досхочу гуляти зі своїми друзями, ходити з ними до Високого Озера на ночівлі та разом шукати сезонні ягоди в глибині лісу."
    "Ти більше не можеш досхочу гуляти зі своїми друзями, ходити з ними до Високого Озера на ночівлі та разом шукати сезонні ягоди в глибині лісу."

# game/script.rpy:150
translate english scene3_16d71cb6:

    # "Не можеш їсти улюблений падісаровий пудинг, адже після нього лусочки болять ще сильніше, а шкіра навколо них тріскає та свербить."
    "Не можеш їсти улюблений падісаровий пудинг, адже після нього лусочки болять ще сильніше, а шкіра навколо них тріскає та свербить."

# game/script.rpy:150
translate english scene3_506c8552:

    # "Не можеш допомагати мамі по господарству так майстерно і швидко, як ти це робила ще кілька років тому."
    "Не можеш допомагати мамі по господарству так майстерно і швидко, як ти це робила ще кілька років тому."

# game/script.rpy:150
translate english scene3_896c880b:

    # "Ти не хочеш стати тягарем для своєї родини і тому ти зараз тут – у місті Сумеру, щоб попросити одного з вчених Академії про допомогу."
    "Ти не хочеш стати тягарем для своєї родини і тому ти зараз тут – у місті Сумеру, щоб попросити одного з вчених Академії про допомогу."

# game/script.rpy:166
translate english scene3_d2cd458e:

    # DT "Вітаю!"
    DT "Вітаю!"

# game/script.rpy:172
translate english scene3_715758f1:

    # GG "Ой!"
    GG "Ой!"

# game/script.rpy:174
translate english scene3_5cc69b00:

    # "Ти так поринаєш у свої думки, що навіть не помічаєш, як до тебе підходить незнайомий чоловік у масці. Яка цікава мода в цьому місті."
    "Ти так поринаєш у свої думки, що навіть не помічаєш, як до тебе підходить незнайомий чоловік у масці. Яка цікава мода в цьому місті."

# game/script.rpy:176
translate english scene3_2a78642a:

    # DT "Не лякайся. У мене невелика перерва в роботі, тож я вирішив спуститись у трактир пообідати. Випадково побачив у тебе на руках елеазар і вирішив підійти."
    DT "Не лякайся. У мене невелика перерва в роботі, тож я вирішив спуститись у трактир пообідати. Випадково побачив у тебе на руках елеазар і вирішив підійти."

# game/script.rpy:179
translate english scene3_6671523c:

    # DT "Тут не зайнято?" nointeract
    DT "Тут не зайнято?" nointeract

# game/script.rpy:184
translate english scene3_90d7f2ee:

    # DT "Хм… Дійсно? Тоді почекаю його разом з тобою, якщо ти не проти."
    DT "Хм… Дійсно? Тоді почекаю його разом з тобою, якщо ти не проти."

# game/script.rpy:188
translate english scene3_5c5a1d8d:

    # DT "Хочеш фокус? Я вмію читати думки"
    DT "Хочеш фокус? Я вмію читати думки"

# game/script.rpy:190
translate english scene3_d68d5456:

    # GG "Ніхто цього не вміє"
    GG "Ніхто цього не вміє"

# game/script.rpy:192
translate english scene3_f22549cd:

    # DT "Що ж, готовий посперечатися на 1000 мори, що я все ж маю певні здібності."
    DT "Що ж, готовий посперечатися на 1000 мори, що я все ж маю певні здібності."

# game/script.rpy:194
translate english scene3_a0a7601a:

    # DT "Хм…"
    DT "Хм…"

# game/script.rpy:196
translate english scene3_e5a63f9d:

    # DT "Ти живеш не у цьому місті, а подорожуєш здалеку?"
    DT "Ти живеш не у цьому місті, а подорожуєш здалеку?"

# game/script.rpy:198
translate english scene3_bc729d66:

    # DT "До тебе долетіла новина, що в Академії ось-ось знайдуть ліки від елеазару і ти хочеш стати піддослідною мишкою?"
    DT "До тебе долетіла новина, що в Академії ось-ось знайдуть ліки від елеазару і ти хочеш стати піддослідною мишкою?"

# game/script.rpy:200
translate english scene3_af144472:

    # GG "Мишкою?"
    GG "Мишкою?"

# game/script.rpy:202
translate english scene3_f43b12ff:

    # GG "..."
    GG "..."

# game/script.rpy:204
translate english scene3_e359a90f:

    # DT "Робота зобов’язує бути таким"
    DT "Робота зобов’язує бути таким"

# game/script.rpy:206
translate english scene3_4fc7962a:

    # DT "Розслабся"
    DT "Розслабся"

# game/script.rpy:208
translate english scene3_3251e669:

    # DT "Мене звати Дотторе і це я шукаю ліки від елеазару. Маю в цьому напрямі деякий прогрес, тому зараз мені потрібні пацієнти, які готові допомогти у експериментах. Ти ж за цим тут?"
    DT "Мене звати Дотторе і це я шукаю ліки від елеазару. Маю в цьому напрямі деякий прогрес, тому зараз мені потрібні пацієнти, які готові допомогти у експериментах. Ти ж за цим тут?"

# game/script.rpy:211
translate english scene3_84fbf598:

    # "Ти збентежено кліпаєш очима та ствердно киваєш головою. Що це: удача, чи архонти намагаються пошвидше спекатись тебе?"
    "Ти збентежено кліпаєш очима та ствердно киваєш головою. Що це: удача, чи архонти намагаються пошвидше спекатись тебе?"

# game/script.rpy:211
translate english scene3_5729dae0:

    # "Дотторе на хвилину відходить і повертається вже з двома чашками в руках."
    "Дотторе на хвилину відходить і повертається вже з двома чашками в руках."

# game/script.rpy:218
translate english scene3_66d84c8d:

    # DT "Сподіваюсь, тобі сподобається. (з’являється зображення чаїнок). Це мій найкращий збір, тримаю для особливих гостей. (зникає зображення чаїнок)"
    DT "Сподіваюсь, тобі сподобається. (з’являється зображення чаїнок). Це мій найкращий збір, тримаю для особливих гостей. (зникає зображення чаїнок)"

# game/script.rpy:220
translate english scene3_32f70c95:

    # "Ти обережно відсьорбуєш чай, який тобі подав Дотторе. Незважаючи на те, що він досить гарячий, напій тобі до смаку і ти продовжуєш його пити, періодично дмухаючи над поверхнею."
    "Ти обережно відсьорбуєш чай, який тобі подав Дотторе. Незважаючи на те, що він досить гарячий, напій тобі до смаку і ти продовжуєш його пити, періодично дмухаючи над поверхнею."

# game/script.rpy:222
translate english scene3_4133647e:

    # DT "Отже, розкажи мені, як давно ти хворієш?"
    DT "Отже, розкажи мені, як давно ти хворієш?"

# game/script.rpy:227
translate english scene3_25e6ce5f:

    # DT "Недовго. Значить, є більше шансів, що ліки швидко подіють і ти через тиждень підеш додому."
    DT "Недовго. Значить, є більше шансів, що ліки швидко подіють і ти через тиждень підеш додому."

# game/script.rpy:229
translate english scene3_d5c90372:

    # DT "Добре, що ти тут. Обіцяю, я докладу всіх зусиль, щоб змінити твоє життя."
    DT "Добре, що ти тут. Обіцяю, я докладу всіх зусиль, щоб змінити твоє життя."

# game/script.rpy:231
translate english scene3_e08c6a07:

    # DT "Пропоную надовго не відкладати і розпочати роботу вже сьогодні. Боюсь, час грає проти нас, тому треба розібратись з цим якнайшвидше."
    DT "Пропоную надовго не відкладати і розпочати роботу вже сьогодні. Боюсь, час грає проти нас, тому треба розібратись з цим якнайшвидше."

# game/script.rpy:233
translate english scene3_8f523952:

    # GG "Погоджуюсь. Можна поставити одне запитання?"
    GG "Погоджуюсь. Можна поставити одне запитання?"

# game/script.rpy:235
translate english scene3_ba203edd:

    # DT "Звісно."
    DT "Звісно."

# game/script.rpy:239
translate english scene3_c0aa7831:

    # DT "Скоріше так, аніж ні. Але обіцяю, що після того, як я з тобою попрацюю, хвороба тебе більше не турбуватиме."
    DT "Скоріше так, аніж ні. Але обіцяю, що після того, як я з тобою попрацюю, хвороба тебе більше не турбуватиме."

# game/script.rpy:241
translate english scene3_2ecfb4bf:

    # DT "Якщо робити висновок з твоїх симптомів, я думаю, знадобиться кілька тижнів. Деяких пацієнтів я відпускав через кілька днів після початку лікування, деяких – через "
    DT "Якщо робити висновок з твоїх симптомів, я думаю, знадобиться кілька тижнів. Деяких пацієнтів я відпускав через кілька днів після початку лікування, деяких – через "

# game/script.rpy:243
translate english scene3_85d8674f:

    # DT "Так. Принаймні, хвороба їх більше не хвилювала."
    DT "Так. Принаймні, хвороба їх більше не хвилювала."

# game/script.rpy:245
translate english scene3_db90f934:

    # DT "Тепер моя черга питати. Елеазаром у родині хворієш тільки ти?"
    DT "Тепер моя черга питати. Елеазаром у родині хворієш тільки ти?"

# game/script.rpy:247
translate english scene3_e0af4366:

    # GG "Так. Брат та мама не заражені"
    GG "Так. Брат та мама не заражені"

# game/script.rpy:249
translate english scene3_1f88d346:

    # DT "Не був би я таким впевненим. Дуже часто діти хворіють разом, тільки у одного елеазар проявляється раніше, а у другого – пізніше, іноді навіть через кілька років."
    DT "Не був би я таким впевненим. Дуже часто діти хворіють разом, тільки у одного елеазар проявляється раніше, а у другого – пізніше, іноді навіть через кілька років."

# game/script.rpy:249
translate english scene3_738a48b5:

    # DT "Якщо симптомів ще нема, я радив би все одно перевірити його стан. Вилікувати елеазар до перших лусочок на тілі можливо одним щепленням, тоді як у твоєму випадку може знадобитись більше часу."
    DT "Якщо симптомів ще нема, я радив би все одно перевірити його стан. Вилікувати елеазар до перших лусочок на тілі можливо одним щепленням, тоді як у твоєму випадку може знадобитись більше часу."

# game/script.rpy:249
translate english scene3_782dcbb2:

    # DT "Можемо відправити брату листа, щоб він прибув сюди і я його зміг оглянути. Якщо все буде добре – підете додому разом, або залишитесь ще на кілька днів."
    DT "Можемо відправити брату листа, щоб він прибув сюди і я його зміг оглянути. Якщо все буде добре – підете додому разом, або залишитесь ще на кілька днів."

# game/script.rpy:249
translate english scene3_da3edcf8:

    # DT "В Сумеру скоро відбудеться свято Прийдення і я впевнений, що вам буде цікаво там побувати. Щороку на головній площі розгортається величезний ярмарок, приїжджають степовики, студенти влаштовують наукові шоу та проводять змагання. Буде купа смаколиків, сувенірів та цікавинок, тож я вважаю, що це буде чудове закінчення твого лікування."
    DT "В Сумеру скоро відбудеться свято Прийдення і я впевнений, що вам буде цікаво там побувати. Щороку на головній площі розгортається величезний ярмарок, приїжджають степовики, студенти влаштовують наукові шоу та проводять змагання. Буде купа смаколиків, сувенірів та цікавинок, тож я вважаю, що це буде чудове закінчення твого лікування."

# game/script.rpy:259
translate english scene3_3da88131:

    # "Його слова звучать як щось неможливе. Ви з братом і мріяти не могли побувати на Прийденні, а цей чоловік ще й пропонує вирішити всі твої проблеми наче помахом магічної палички"
    "Його слова звучать як щось неможливе. Ви з братом і мріяти не могли побувати на Прийденні, а цей чоловік ще й пропонує вирішити всі твої проблеми наче помахом магічної палички"

# game/script.rpy:261
translate english scene3_33a6b33b:

    # GG "Що я маю дати взамін? У нас не так багато грошей, якщо казати відверто"
    GG "Що я маю дати взамін? У нас не так багато грошей, якщо казати відверто"

# game/script.rpy:263
translate english scene3_e22c0349:

    # DT smile large "Тільки взяти участь у моєму експерименті. Це все."
    DT smile large "Тільки взяти участь у моєму експерименті. Це все."

# game/script.rpy:265
translate english scene3_46a332cf:

    # GG "І все?"
    GG "І все?"

# game/script.rpy:267
translate english scene3_eb81a2a0:

    # DT "Так. Гроші на дослідження видає Академія, кімнатою та харчуванням вона також забезпечить."
    DT "Так. Гроші на дослідження видає Академія, кімнатою та харчуванням вона також забезпечить."

# game/script.rpy:269
translate english scene3_20a202ef:

    # DT "Найкраща нагорода для лікаря – здоровий пацієнт."
    DT "Найкраща нагорода для лікаря – здоровий пацієнт."

# game/script.rpy:287
translate english scene3_tavern_menu_e1bfea54:

    # T "Чого бажаєте?" nointeract
    T "Чого бажаєте?" nointeract

# game/script.rpy:302
translate english scene3_tavern_drinks_ee39e290:

    # T "Що будете пити?" nointeract
    T "Що будете пити?" nointeract

# game/script.rpy:314
translate english scene4_with_letter_56f3b959:

    # "Ти вирішуєш довіритись вченому і на під його наглядом пишеш невеликого листа брату, щоб той прибув у місто якомога швидше."
    "Ти вирішуєш довіритись вченому і на під його наглядом пишеш невеликого листа брату, щоб той прибув у місто якомога швидше."

# game/script.rpy:314
translate english scene4_with_letter_0301ba53:

    # "Ти залишаєш детальні інструкції, де можна буде знайти з Дотторе, якщо по якійсь причині ти не зможеш його зустріти."
    "Ти залишаєш детальні інструкції, де можна буде знайти з Дотторе, якщо по якійсь причині ти не зможеш його зустріти."

# game/script.rpy:314
translate english scene4_with_letter_0befed0e:

    # "Вчений навпроти тебе начебто нікуди не спішить, п’є чай і лише періодично вносить якісь уточнення в текст."
    "Вчений навпроти тебе начебто нікуди не спішить, п’є чай і лише періодично вносить якісь уточнення в текст."

# game/script.rpy:322
translate english scene4_with_letter_a9d937ff:

    # DT "Готово? Дай мені, я закину його у поштову скриньку, а ти поки іди в Академію. Знайдеш там секретаря і попросиш заселити тебе у кімнату. Завтра зранку я зайду за тобою і ми почнемо лікування, якщо ти не передумаєш, звісно."
    DT "Готово? Дай мені, я закину його у поштову скриньку, а ти поки іди в Академію. Знайдеш там секретаря і попросиш заселити тебе у кімнату. Завтра зранку я зайду за тобою і ми почнемо лікування, якщо ти не передумаєш, звісно."

# game/script.rpy:324
translate english scene4_with_letter_2e014bae:

    # DT "А, ще згадав. Постарайся мінімально контактувати зі студентами та викладачами. Багато з них дуже упереджено ставляться до хворих елеазаром, тому не варто їх нервувати."
    DT "А, ще згадав. Постарайся мінімально контактувати зі студентами та викладачами. Багато з них дуже упереджено ставляться до хворих елеазаром, тому не варто їх нервувати."

# game/script.rpy:326
translate english scene4_with_letter_c5f6f41a:

    # "Ти киваєш головою і віддаєш листа вченому. Той прощається з тобою і наостанок детально розповідає, як дійти до Академії та де саме можна знайти секретаря."
    "Ти киваєш головою і віддаєш листа вченому. Той прощається з тобою і наостанок детально розповідає, як дійти до Академії та де саме можна знайти секретаря."

# game/script.rpy:326
translate english scene4_with_letter_a5976d27:

    # "Дотторе каже, що зайде по тебе завтра зранку і просить нікуди не йти, особливо в пошуках сніданку. Ти з усім погоджуєшся і виходиш з таверни слідом за лікарем."
    "Дотторе каже, що зайде по тебе завтра зранку і просить нікуди не йти, особливо в пошуках сніданку. Ти з усім погоджуєшся і виходиш з таверни слідом за лікарем."

# game/script.rpy:333
translate english scene4_with_letter_bc256b0f:

    # "Сонце вже почало сідати за горизонт."
    "Сонце вже почало сідати за горизонт."

# game/script.rpy:333
translate english scene4_with_letter_308a82b4:

    # "Ти прощаєшся з Дотторе і спішиш піднятись по вказаній дорозі до Академії, щоб нарешті вирішити всі запитання та лягти спати раніше."
    "Ти прощаєшся з Дотторе і спішиш піднятись по вказаній дорозі до Академії, щоб нарешті вирішити всі запитання та лягти спати раніше."

# game/script.rpy:341
translate english scene4_with_letter_bdd36972:

    # GG "Нарешті я можу відпочити"
    GG "Нарешті я можу відпочити"

# game/script.rpy:343
translate english scene4_with_letter_56b8c667:

    # "Ти без проблем заселяєшся у житло. Секретар не задавав зайвих запитань і після одного погляду на твої руки з лусочками без коментарів віддав ключі від кімнати."
    "Ти без проблем заселяєшся у житло. Секретар не задавав зайвих запитань і після одного погляду на твої руки з лусочками без коментарів віддав ключі від кімнати."

# game/script.rpy:343
translate english scene4_with_letter_548b5c25:

    # "Що ж, цей день був довгим і як тільки ти сідаєш на стільчик, твої очі самі собою починають закриватись. Більшість вчених відпочиває або готується до завтрашніх лекцій/досліджень, тож і ти вирішуєш готуватись до сну."
    "Що ж, цей день був довгим і як тільки ти сідаєш на стільчик, твої очі самі собою починають закриватись. Більшість вчених відпочиває або готується до завтрашніх лекцій/досліджень, тож і ти вирішуєш готуватись до сну."

# game/script.rpy:351
translate english scene4_with_letter_a00f2e46:

    # "Змиваючи пил та пісок зі шкіри, ти мимо волі думаєш про сім’ю, яка залишилась вдома. Цікаво, як швидко доставлять твого листа? Чи зможе мама привести брата у місто? А раптом у нього теж елеазар? Ти починаєш нервувати, але швидко заспокоюєш себе. Навряд чи брат також захворів, а якщо так, то лікар Дотторе зможе йому допомогти. Мабуть. Від води лусочки на тілі починають пекти ще більше і ти спішиш вимкнути воду та витерти тіло м’яким рушником. (звук води всьо) Тріщини на шкірі знову почали сочитися кров’ю. Потрібно лягати спати. Завтра точно буде краще."
    "Змиваючи пил та пісок зі шкіри, ти мимо волі думаєш про сім’ю, яка залишилась вдома. Цікаво, як швидко доставлять твого листа? Чи зможе мама привести брата у місто? А раптом у нього теж елеазар? Ти починаєш нервувати, але швидко заспокоюєш себе. Навряд чи брат також захворів, а якщо так, то лікар Дотторе зможе йому допомогти. Мабуть. Від води лусочки на тілі починають пекти ще більше і ти спішиш вимкнути воду та витерти тіло м’яким рушником. (звук води всьо) Тріщини на шкірі знову почали сочитися кров’ю. Потрібно лягати спати. Завтра точно буде краще."

# game/script.rpy:362
translate english scene4_with_letter_ceb4f97a:

    # GG "Що за…"
    GG "Що за…"

# game/script.rpy:364
translate english scene4_with_letter_0811c012:

    # "Ти точно пам’ятаєш, що десять хвилин тому світло у кімнаті було увімкнене."
    "Ти точно пам’ятаєш, що десять хвилин тому світло у кімнаті було увімкнене."

# game/script.rpy:364
translate english scene4_with_letter_2839c2ee:

    # "Ти нервово шукаєш перемикач, але в темряві не можеш намацати його."
    "Ти нервово шукаєш перемикач, але в темряві не можеш намацати його."

# game/script.rpy:370
translate english scene4_with_letter_8af88070:

    # GG "Спокійно. Все добре. Мабуть, воно вимикається само собою."
    GG "Спокійно. Все добре. Мабуть, воно вимикається само собою."

# game/script.rpy:372
translate english scene4_with_letter_14bf0e38:

    # "Так, ці розумні вчені точно зробили світло, що вимикається самостійно. Точно."
    "Так, ці розумні вчені точно зробили світло, що вимикається самостійно. Точно."

# game/script.rpy:374
translate english scene4_with_letter_fb80dbc6:

    # "Боятися нема чого."
    "Боятися нема чого."

# game/script.rpy:376
translate english scene4_with_letter_42e933c5:

    # GG "Та де ж ти?"
    GG "Та де ж ти?"

# game/script.rpy:378
translate english scene4_with_letter_4aeddd9d:

    # GG "Га?\""
    GG "Га?\""

# game/script.rpy:378
translate english scene4_with_letter_1c391a0b:

    # GG "Тут хтось є?"
    GG "Тут хтось є?"

# game/script.rpy:386
translate english scene4_with_letter_e7496f71:

    # GG "…"
    GG "…"

# game/script.rpy:386
translate english scene4_with_letter_547f6476:

    # GG "Хто тут?"
    GG "Хто тут?"

# game/script.rpy:386
translate english scene4_with_letter_e7496f71_1:

    # GG "…"
    GG "…"

# game/script.rpy:386
translate english scene4_with_letter_3d04ef85:

    # GG "Агов?"
    GG "Агов?"

# game/script.rpy:386
translate english scene4_with_letter_97c4300f:

    # GG "Мабуть, у мене галюцинації…"
    GG "Мабуть, у мене галюцинації…"

# game/script.rpy:403
translate english scene4_with_letter_12fa6ddc:

    # DT "Вибач, не зміг чекати до ранку"
    DT "Вибач, не зміг чекати до ранку"

# game/script.rpy:414
translate english scene4_without_letter_5d5da83d:

    # "Ти не хочеш писати листа. Зрештою, якби у брата чи мами був елеазар, це окрім тебе точно хтось помітив би."
    "Ти не хочеш писати листа. Зрештою, якби у брата чи мами був елеазар, це окрім тебе точно хтось помітив би."

# game/script.rpy:416
translate english scene4_without_letter_4f9ad5ca:

    # GG " Дякую, проте це не потрібно."
    GG " Дякую, проте це не потрібно."

# game/script.rpy:418
translate english scene4_without_letter_d81f1714:

    # DT neutral "Діло твоє"
    DT neutral "Діло твоє"

# game/script.rpy:420
translate english scene4_without_letter_4a229f00:

    # "Дотторе уважно роздивляється твої руки, але більше нічого не каже. Ти стискаєшся і намагаєшся приховати лусочки під рукавами, проте тобі це не дуже вдається"
    "Дотторе уважно роздивляється твої руки, але більше нічого не каже. Ти стискаєшся і намагаєшся приховати лусочки під рукавами, проте тобі це не дуже вдається"

# game/script.rpy:423
translate english scene4_without_letter_fae2f197:

    # DT "Я думаю, ми можемо вже сьогодні почати лікування. Пішли до мене в лабораторію, дам тобі першу дозу ліків, щоб не затягувати."
    DT "Я думаю, ми можемо вже сьогодні почати лікування. Пішли до мене в лабораторію, дам тобі першу дозу ліків, щоб не затягувати."

# game/script.rpy:425
translate english scene4_without_letter_4c01273b:

    # "Ви допиваєте чай і покидаєте трактир."
    "Ви допиваєте чай і покидаєте трактир."

# game/script.rpy:429
translate english scene4_without_letter_e887f1a3:

    # DT "Завжди бісило в цьому Сумеру те, що тут так рано темніє"
    DT "Завжди бісило в цьому Сумеру те, що тут так рано темніє"

# game/script.rpy:431
translate english scene4_without_letter_4ac90e80:

    # GG "Хіба це рано?"
    GG "Хіба це рано?"

# game/script.rpy:433
translate english scene4_without_letter_d168bf32:

    # DT "Так. На моїй батьківщині сонце встає о сьомій ранку і сідає о дев’ятій вечора."
    DT "Так. На моїй батьківщині сонце встає о сьомій ранку і сідає о дев’ятій вечора."

# game/script.rpy:435
translate english scene4_without_letter_e392e3f5:

    # "Ви ідете по закрученим дорогам міста. Вулиці майже пусті, лише деінде стоять стражі порядку. Дотторе іноді кивком голови з кимось вітається, але іде мовчки, думаючи про своє."
    "Ви ідете по закрученим дорогам міста. Вулиці майже пусті, лише деінде стоять стражі порядку. Дотторе іноді кивком голови з кимось вітається, але іде мовчки, думаючи про своє."

# game/script.rpy:439
translate english scene4_without_letter_c7a48842:

    # GG "Як буде проходити лікування? В сенсі, це пігулки, чи мазі якісь?"
    GG "Як буде проходити лікування? В сенсі, це пігулки, чи мазі якісь?"

# game/script.rpy:440
translate english scene4_without_letter_a87c585f:

    # DT "Трошки того, трошки іншого. Потім розповім, бо в цих вулиць є дуже цікаві вуха, які дуже хочуть внести своє ім’я в підручники, але не бажають навіть пальцем ворухнути для цього."
    DT "Трошки того, трошки іншого. Потім розповім, бо в цих вулиць є дуже цікаві вуха, які дуже хочуть внести своє ім’я в підручники, але не бажають навіть пальцем ворухнути для цього."

# game/script.rpy:442
translate english scene4_without_letter_625ccf7c:

    # GG "Як довго ти цим займаєшся? Чому так довго ніхто не міг знайти ліки від елеазару?"
    GG "Як довго ти цим займаєшся? Чому так довго ніхто не міг знайти ліки від елеазару?"

# game/script.rpy:443
translate english scene4_without_letter_a0eb8dec:

    # DT "Близько десяти років, але цікавився темою з дитинства. Елеазар важко досліджувати, адже мало хто погоджується стати піддослідним кроликом, щоб допомогти лікарям знайти чарівну пігулку від хвороби"
    DT "Близько десяти років, але цікавився темою з дитинства. Елеазар важко досліджувати, адже мало хто погоджується стати піддослідним кроликом, щоб допомогти лікарям знайти чарівну пігулку від хвороби"

# game/script.rpy:444
translate english scene4_without_letter_f43b12ff:

    # GG "..."
    GG "..."

# game/script.rpy:445
translate english scene4_without_letter_fcfda09c:

    # GG "Мені не подобається порівняння з кроликом"
    GG "Мені не подобається порівняння з кроликом"

# game/script.rpy:446
translate english scene4_without_letter_4051e235:

    # DT smile "Нікому не подобається"
    DT smile "Нікому не подобається"

# game/script.rpy:448
translate english scene4_without_letter_c4631287:

    # DT "Майже на місці"
    DT "Майже на місці"

# game/script.rpy:452
translate english scene4_without_letter_31859da6:

    # "Сонце зовсім зайшло за горизонт і стало набагато прохолодніше. Ти кутаєшся в дорожній плащ та непомітно для вченого позіхаєш, прикривши рота долонею. Довго дорога сильно втомила тебе, а ситна вечеря – в кінець розморила."
    "Сонце зовсім зайшло за горизонт і стало набагато прохолодніше. Ти кутаєшся в дорожній плащ та непомітно для вченого позіхаєш, прикривши рота долонею. Довго дорога сильно втомила тебе, а ситна вечеря – в кінець розморила."

# game/script.rpy:452
translate english scene4_without_letter_cc6a83c9:

    # "Здається, ви з Дотторе вже вийшли за місто. Навколо немає ні будинків, ні людей, ні вуличних тварин, тільки голосніше співають цвіркуни. Ти починаєш нервуватись і думаєш, чи не варто тобі повернути назад. Адже ще не пізно звернутись в Академію чи пошукати хостел на цю ніч."
    "Здається, ви з Дотторе вже вийшли за місто. Навколо немає ні будинків, ні людей, ні вуличних тварин, тільки голосніше співають цвіркуни. Ти починаєш нервуватись і думаєш, чи не варто тобі повернути назад. Адже ще не пізно звернутись в Академію чи пошукати хостел на цю ніч."

# game/script.rpy:459
translate english scene4_without_letter_a3b467f2:

    # DT "Ось і прийшли"
    DT "Ось і прийшли"

# game/script.rpy:461
translate english scene4_without_letter_b7c27580:

    # "Дотторе відчиняє масивні ворота і ви разом заходите у двір невеликого будинку, який сховався у високих густих сумерських заростях. Вчений провертає ключ і пропускає тебе у темний будинок"
    "Дотторе відчиняє масивні ворота і ви разом заходите у двір невеликого будинку, який сховався у високих густих сумерських заростях. Вчений провертає ключ і пропускає тебе у темний будинок"

# game/script.rpy:471
translate english scene4_without_letter_45f21ed0:

    # DT "Зліва від тебе сходи вниз. Спускайся, там є світло."
    DT "Зліва від тебе сходи вниз. Спускайся, там є світло."

# game/script.rpy:473
translate english scene4_without_letter_1f30ca65:

    # GG "Ем…"
    GG "Ем…"

# game/script.rpy:483
translate english downsteirs_a1931bdf:

    # "Ти робиш крок назад, але натикаєшся на Дотторе, який стоїть відразу за тобою"
    "Ти робиш крок назад, але натикаєшся на Дотторе, який стоїть відразу за тобою"

# game/script.rpy:484
translate english downsteirs_3a7bebc9:

    # DT "Чого ти? Іди вперед"
    DT "Чого ти? Іди вперед"

# game/script.rpy:485
translate english downsteirs_b8e3dd51:

    # "Тобі нічого не залишається як підкоритись"
    "Тобі нічого не залишається як підкоритись"

# game/script.rpy:495
translate english scene4_without_letter_basement_525a4503:

    # "Ти обережно ступаєш по сходах. Схоже, це якесь підвальне приміщення, яке дійсно підсвічується слабкими вогниками вздовж стіни, тож ти із лікарем без перешкод опиняєтесь внизу"
    "Ти обережно ступаєш по сходах. Схоже, це якесь підвальне приміщення, яке дійсно підсвічується слабкими вогниками вздовж стіни, тож ти із лікарем без перешкод опиняєтесь внизу"

# game/script.rpy:499
translate english scene4_without_letter_basement_53b49480:

    # GG "Що?"
    GG "Що?"

# game/script.rpy:499
translate english scene4_without_letter_basement_53d280ec:

    # GG "Гей! Не потрібно мене зачиняти!"
    GG "Гей! Не потрібно мене зачиняти!"

# game/script.rpy:499
translate english scene4_without_letter_basement_05ec8a59:

    # GG "А?.."
    GG "А?.."

# game/script.rpy:508
translate english scene4_without_letter_basement_bc8fd378:

    # GG "Що відбувається?"
    GG "Що відбувається?"

# game/script.rpy:513
translate english scene4_without_letter_basement_f43b12ff:

    # GG "..."
    GG "..."

# game/script.rpy:515
translate english scene4_without_letter_basement_332ea0a8:

    # GG "Де я?"
    GG "Де я?"

# game/script.rpy:517
translate english scene4_without_letter_basement_9e5553cf:

    # DT "А на що схоже?"
    DT "А на що схоже?"

# game/script.rpy:520
translate english scene4_without_letter_basement_3b612b1a:

    # DT "Будемо лікуватись?"
    DT "Будемо лікуватись?"

# game/script.rpy:521
translate english scene4_without_letter_basement_e7496f71:

    # GG "…"
    GG "…"

# game/script.rpy:522
translate english scene4_without_letter_basement_4b1104d4:

    # GG "Ні."
    GG "Ні."

# game/script.rpy:523
translate english scene4_without_letter_basement_812132b4:

    # DT "В будь-якому разі вже темно, повертатись назад пізно."
    DT "В будь-якому разі вже темно, повертатись назад пізно."

# game/script.rpy:524
translate english scene4_without_letter_basement_4adf98a1:

    # DT "Кажуть, у місті люди ночами…"
    DT "Кажуть, у місті люди ночами…"

# game/script.rpy:525
translate english scene4_without_letter_basement_e1508d0e:

    # extend "…пропадають…"
    extend "…пропадають…"

# game/script.rpy:527
translate english scene4_without_letter_basement_b73a37d3:

    # "У тебе починає крутитись голова. Ноги терпнуть, руки трясуться настільки, що ти навіть не можеш схопитись за невеликий ніж на поясі, яким ти зазвичай користуєшся у походах."
    "У тебе починає крутитись голова. Ноги терпнуть, руки трясуться настільки, що ти навіть не можеш схопитись за невеликий ніж на поясі, яким ти зазвичай користуєшся у походах."

# game/script.rpy:529
translate english scene4_without_letter_basement_5052cfff:

    # DT "Хороший чай, правда? Головне правильно розрахувати час."
    DT "Хороший чай, правда? Головне правильно розрахувати час."

# game/script.rpy:531
translate english scene4_without_letter_basement_8cde509b:

    # GG "Я… мене шукатимуть."
    GG "Я… мене шукатимуть."

# game/script.rpy:533
translate english scene4_without_letter_basement_4abe68e5:

    # DT "Хай шукають."
    DT "Хай шукають."

# game/script.rpy:534
translate english scene4_without_letter_basement_a8bd4dac:

    # DT "Можливо, навіть знайдуть. Я не проти."
    DT "Можливо, навіть знайдуть. Я не проти."

# game/script.rpy:535
translate english scene4_without_letter_basement_0bdc489a:

    # DT "А тепер пора спати."
    DT "А тепер пора спати."

# game/script.rpy:540
translate english scene4_without_letter_basement_14b1f472:

    # DT "Нас чекає цікаве дослідження."
    DT "Нас чекає цікаве дослідження."

translate english strings:

    # game/script.rpy:17
    old "чудово"
    new "Good"

    # game/script.rpy:19
    old "жахливо"
    new "baaaad"

    # game/script.rpy:61
    old "Кажуть, що в Академії знайшли ліки від елеазару. Хочу перевірити їх на собі"
    new "Кажуть, що в Академії знайшли ліки від елеазару. Хочу перевірити їх на собі"

    # game/script.rpy:61
    old "Підлікуватись та відпочити у гарному місці"
    new "Підлікуватись та відпочити у гарному місці"

    # game/script.rpy:61
    old "Шукаю одного лікаря, який живе тут"
    new "Шукаю одного лікаря, який живе тут"

    # game/script.rpy:178
    old "Прошу"
    new "Прошу"

    # game/script.rpy:178
    old "Мій друг зараз прийде"
    new "Мій друг зараз прийде"

    # game/script.rpy:225
    old "Кілька місяців"
    new "Кілька місяців"

    # game/script.rpy:225
    old "Кілька років"
    new "Кілька років"

    # game/script.rpy:237
    old "Це боляче?"
    new "Це боляче?"

    # game/script.rpy:237
    old "Це довго?"
    new "Це довго?"

    # game/script.rpy:237
    old "Чи хтось вже вилікувався?"
    new "Чи хтось вже вилікувався?"

    # game/script.rpy:271
    old "Ти вагаєшся. Що робити?"
    new "Ти вагаєшся. Що робити?"

    # game/script.rpy:271
    old "Написати листа"
    new "Написати листа"

    # game/script.rpy:271
    old "Не писати листа"
    new "Не писати листа"

    # game/script.rpy:286
    old "Ароматні м’ясні кульки"
    new "Ароматні м’ясні кульки"

    # game/script.rpy:286
    old "Грибне асорті"
    new "Грибне асорті"

    # game/script.rpy:286
    old "Тропічний салат"
    new "Тропічний салат"

    # game/script.rpy:286
    old "Курча в маслі"
    new "Курча в маслі"

    # game/script.rpy:286
    old "Піту"
    new "Піту"

    # game/script.rpy:301
    old "Чай"
    new "Чай"

    # game/script.rpy:301
    old "Сік"
    new "Сік"

    # game/script.rpy:301
    old "Молоко"
    new "Молоко"

    # game/script.rpy:301
    old "Вино"
    new "Вино"

    # game/script.rpy:437
    old "Поговорити про лікування"
    new "Поговорити про лікування"

    # game/script.rpy:437
    old "Спитати про дослідження"
    new "Спитати про дослідження"

    # game/script.rpy:465
    old "Агов?"
    new "Агов?"

    # game/script.rpy:465
    old "Можна увімкнути світло?"
    new "Можна увімкнути світло?"

    # game/script.rpy:478
    old "Спуститись"
    new "Спуститись"

    # game/script.rpy:478
    old "Повернути назад"
    new "Повернути назад"

