label scene2:
    scene bg city bazar peoples

    pause

    "Ти ідеш по місту роззираючись навколо."
    
    "Сонце в зеніті і добряче пече потилицю, тому ти вирішуєш накинути капюшон, щоб сховатись від нього."

    show bg city bazar peoples 2

    "Ти потрапляєш на вуличку, на якій розташувалась велика кількість крамничок з фруктами, овочами, місцевим одягом та сувенірами."
    
    "Навколо них скупчилось багато туристів, тому ти ідеш далі, щоб не штовхатись у натовпі."

    show bg city bazar peoples 2

    "Біля дороги росте дуже багато дерев та рослин, більшість з яких тобі не знайомі."

    "Повз тебе іноді проходять люди в однаковому зеленому одязі і ти робиш висновок, що це студенти Академії, в яку обов’язково потрібно потрапити до настання сутінок."
    
    "Можливо, тобі навіть дозволять оселитись у студентських кімнатах, що було би дуже доречно, так як на свою подорож ти витрачаєш майже всі власні кошти."


    """
    
    Тобі постійно доводиться підійматись вгору, що швидко виснажує і без того стомлене тіло, від постійного крику починає боліти голова, а запах свіжого хліба нагадує, що настав час поїсти.
    
    Тому ти без вагань запитуєш у перехожого, де знаходиться трактир.
    """

    jump scene3
