label scene5:
    
    call day(_("День 1"))

    scene bg laboratory with dissolve
    play music "day-1.mp3"

    "Ти прокидаєшся після глибокого сну. Голова болить так, що здається, її легше відрубати, аніж вилікувати."
    
    "Ти намагаєшся торкнутись лоба, але тобі щось заважає це зробити. Опустивши очі ти розумієш, що твої руки та ноги міцно прив’язані до медичного стільчика, який стоїть посеред кімнати."
    
    "Позаду щось шарудить, але ти не можеш сфокусуватись і подивитися, чи є хтось поруч із тобою."


    menu: 
        "Сидіти тихо і спробувати все роздивитись":
            "Ти обережно роздивляєшся приміщення з-під опущених вій. Поруч немає нічого, що могло би допомогти тобі звільнитись чи послати комусь запит про допомогу."

        "Спробувати звільнитись":
            "Ти прикладаєш немало сили, щоб розірвати шкіряні ремені, які утримують тебе на кріслі, проте вони досить міцні і всі твої зусилля виявляються марними."

        "Покликати на допомогу":
            GG "Агов? Тут є хтось?"
            GG "Допоможіть мені, будь ласка! Мене привели сюди обманом!"



    DT "О, хтось нарешті прокинувся?"


    show dottore at center

    DT "Як ніч? Що снилось?"

    GG "Що?"
    GG "Відпусти мене! Сталось якесь непорозуміння!"
    GG "Я не хочу тут бути!"

    DT "А? То я вчора помилився?"

    GG "Так!"
    
    DT "І елеазар ти вилікувати не хочеш?"

    GG "Хочу! Але… Чому мене прив’язали?"

    DT "Вчусь на своїх помилках. Всі щурики намагаються звідси втекти, коли дізнаються, чим ми тут будемо займатись."

    GG "Вони всі… Ти їх вбив?"

    DT "Ні. Я що, схожий на маніяка?"

    GG "…"


    DT "Отож."
    DT "Всі хочуть вилікуватись, але чомусь ніхто не хоче допомогти знайти ці ліки."
    DT "Люди думають, що всі знання і відкриття приходять до вчених уві сні чи під час читання книг. Що ніхто не перевіряє гіпотези, не ставить експерименти."
    DT "Тому доводиться іти на різні хитрощі, щоб отримати матеріали та піддослідних."
    DT "Тим паче що пошук лікування не дуже приємний процес."

    GG "…"
    GG "Розв’яжи мене."

    DT "Через кілька хвилин обов’язково розв’яжу."
    GG "Я не втікатиму."
    DT "Всі вони теж так казали."


    DT """
    Дивись, є два варіанти.
    
    Перший: ти будеш хорошим щуриком і допомагатимеш мені у дослідженні.
    
    Тоді я не витрачатиму сили на те, щоб тебе вкласти на місце, не буду користуватись заспокійливими, які можуть вплинути на кінцевий результат, і, можливо, навіть виділю тобі власне особисте місце в лабораторії на час перебування тут.
    
    Другий: ти будеш поганим щуриком, який всіляко буде заважати мені працювати. В цьому випадку я не гарантую тобі швидке повернення додому і емпатичне відношення під час неприємних процедур.
    
    Буду чесним – я не зацікавлений випускати тебе звідси, поки не перевірю кілька препаратів та теорій, над якими я працюю вже досить довгий час.
    
    Ну то як?
    """

    menu: 
        "Добре, я не опиратимусь":
            $ dotore_mad += -10
        "Промовчати":
            $ dotore_mad += 0
        "Ти гидкий покидьок і я не вірю жодному твоєму слову":
            $ dotore_mad += 10
    
    DT "Іншого я і не чекав."
    DT "Не рухайся."

    menu: 
        "Опиратись":
            $ dotore_mad += 10
            show bg laboratory night with Shake((0.5, 1.0, 0.5, 1.0), 4, dist=5)
            
            
            DT "Сиди спокійно."
            show bg laboratory night with Shake((0.5, 1.0, 0.5, 1.0), 1.5, dist=10)

            "Ляпас виявився неочікувано сильним. Поки ти намагаєшся сфокусувати погляд на вченому, він швидко робить укол у плече невідомою тобі речовиною"
            

            image half_black = Color((0, 0, 0, 150))

            call .ukol

            GG "Що це?"
            DT "Ну, нехай буде заспокійливе"
        
        "Нічого не робити":
            $ dotore_mad += -10
            "Дотторе робить укол у плече невідомою тобі речовиною"
            call .ukol

    "У тебе починають терпнути руки, а серце - калатати десь у горлі. Ноги наливаються свинцем і тягнуть все тіло додолу."
    "Ти намагаєшся ворухнути пальцем і це тобі вдається, проте від прикладених зусиль на чолі виступають краплинки поту."
    "Лабораторія крутиться, ніби ти п’єш другий келих вина."

    DT "Як я і обіцяв."

    "Дотторе розстібає всі ремені, які утримували тебе весь цей час. Ти хочеш скочити на ноги і втікти звідси подалі, але тіло слухається дуже погано."
    "Ти повільно встаєш зі свого місця, тримаючись за галантно підставлену руку вченого."

    DT "Роздягайся і лягай на кушетку. Будемо дивитись, що можна з твоїм елеазаром зробити."
    GG "…"
    DT "Одяг можеш покласти на крісло."
    GG "…"
    GG "Чому?"
    DT "Не на підлогу ж його кидати."
    GG "В сенсі… чому я маю… роздягатись?"
    "Говорити ще важче, ніж рухатись. Дотторе знизує плечима."
    DT "Тому що мені так легше працювати. Не буду ж я розглядати місця ураження через одяг."
    "Ти вагаєшся. Перспектива залишитись без одягу абсолютно не приваблює тебе, тим паче перед цим хворим лікарем."
    DT "Не затягуй процес. Швидше ляжеш – швидше проведу дослідження. Швидше проведу дослідження - швидше підеш додому."

    menu:
        "Хай буде по-твоєму":
            $ dotore_mad -= 10

        "Я не вірю жодному твоєму слову!":
            $ dotore_mad += 10


    DT """Ти можеш думати що завгодно, мені все одно. Головна моя задача – допомогти знайти ліки від елеазару, і чим швидше це станеться, тим краще.
    Для всіх.
    В будь-якому випадку, вибору у тебе нема.   
    Я тебе не відпущу, поки не зроблю все необхідне.
    """

    """
    Дотторе знищує навіть ілюзію, що хоч щось під твоїм контролем.
    Ти починаєш повільно роздягатись. Пальці зісковзують з ґудзиків, знімати частини одягу неймовірно важко.
    Дотторе не підганяє тебе, та й взагалі займається своїми справами: відмічає щось у записнику, розкладає медичні інструменти на підносі, збовтує якісь рідини в пробірках і навіть не дивиться у твою сторону.
    """

    DT "Знімай все і лягай."

    """
    Ти залишаєш свої речі на кріслі і, ніяково переступаючи голими ступнями по холодній підлозі, підходиш до кушетки, яка стоїть під яскравим світлом ламп.
    Лусочки елеазару чіпляються за простирадло, яким Дотторе накрив поверхню.
    Ти вкладаєшся настільки зручно, наскільки це взагалі можливо у даній ситуації.
    На шкірі від холоду виступають дрібні сироти.
    """

    DT "Бачу, все готово. Отож, почнімо!"
    "Дотторе пристібає твої руки та ноги до кушетки ременями, такими ж, як і на кріслі."
    DT "Це для того, щоб нічого не заважало."
    "Лікар вдягає медичні рукавички і нахиляється до тебе, роздивляючись уражену хворобою шкіру."
    DT "Мені треба зібрати анамнез. Постарайся пригадати і відповідай максимально чесно."


    menu:
        DT "Зараз у тебе йде стадія загострення чи це нормальний стан елеазару?"
        
        "Загострення":
            $ False
        "Нормальний стан":
            $ False

    menu:
        DT "Добре. Ти якось його лікуєш? Мазі, настоянки?"
        "Не лікую":
            $ Fade
        "Лікую симптоматично":
            menu:
                DT "І як, щось допомагало?"
                "Ні":
                    $ Fade
                "Є ліки, які допомагають знімати симптоми":
                    $ Fade

    menu: 
        DT "Нічого нового. Де ти живеш? Місто, поселення у лісі?"

        "Місто":
            $ False
        "Поселення":
            $ False

    menu: 
        DT "Чи робили тобі якісь операції?"

        "Так":
            $ False
        "Ні":
            $ False

    DT "Дякую за чесність."

    DT """
    Що ж.
    Що ж.
    Я довго працюю з хворими на елеазар і впевнений, що я знаю про нього найбільше серед усіх жителів Тейвату.
    Протягом кількох років я збирав всю інформацію, яку тільки міг отримати. Книги, чужі записи, розповіді про хворобу.
    Я знаю про всі спроби знайти ліки від елеазару і знаю, чим закінчилась кожна з них.
    Нічим, насправді.
    Головна помилка тих вчених була у тому, що вони остерігалися використовувати радикальні методи і сподівались вирішити проблему за допомогою таблеток, настоянок та екстрактів, кремів, мазей та примочок.
    Як я вже сказав, результат був нульовим, зате грошей на ці дослідження витратили купу і ще трішки.
    Ідіоти.
    Я ж прихильник більш жорстких методів, тим паче що більшість з них дійсно працюють, якщо говорити про інші хвороби.
    """

    GG "…"
    GG "Це ж… які такі методи?"
    DT "Скоро дізнаєшся кілька з них."
    DT "У тебе уражені обидві руки та ноги, тож якщо ти витримаєш, я зможу перевірити відразу кілька гіпотез."
    GG "В… Витримаю?"
    DT "Ага. Всі попередні піддослідні виявились досить слабкими фізично і тому завчасно покинули цей світ."
    GG "Що ти… робитимеш… зі мною?"
    DT "Що зможу."

    show dottore knife test_tube


    DT """Якщо хочеш, можеш допомогти мені.
    Маю для тебе на вибір два варіанти.
    """

    DT "Який більше подобається?"

    menu:
        DT "Який більше подобається?"
        "Ніж":
            jump scene6_1
        "Пробірка з рідиною":
            jump scene6_2


label .ukol:
    window hide
    with None
    show half_black 
    show ukol
    with dissolve

    pause
    hide ukol 
    hide half_black
    with dissolve

    window auto

    return

