label scene2:
    scene bg city sumeru

    pause

    "Ти ідеш по місту роззираючись навколо. Сонце в зеніті і добряче потилицю, тому ти вирішуєш накинути капюшон, щоб сховатись від нього"

    show bg city sumeru market

    "Ти потрапляєш на вуличку, на якій розташувалась велика кількість крамничок з фруктами, овочами, місцевим одягом та сувенірами. Навколо них скупчилось багато туристів, тому ти ідеш далі, щоб не штовхатись у натовпі."

    show bg city sumeru flower

    "Біля дороги росте дуже багато дерев та рослин, більшість з яких тобі не знайомі. Ти з цікавістю нахиляєшся, щоб понюхати незвичайну красиву квітку з прозорими пелюстками і зі здивуванням виявляєш, що та реагує на твоє наближення нервовим поворотом стебла. Тобі стає не по собі через відчуття, ніби вона за тобою стежить, тому ти вирішуєш не чіпати її та йдеш собі геть"

    show bg city sumeru students

    "Повз тебе іноді проходять люди в однаковому зеленому одязі і ти робиш висновок, що це студенти Академії, в яку обов’язково потрібно потрапити до настання сутінок. Можливо, тобі навіть дозволять оселитись у студентських кімнатах, що було би дуже доречно, так як на свою подорож ти витрачаєш майже всі власні кошти."


    show bg city sumeru industrial_quarter

    """
    Ти повільно доходиш до кварталу, де працюють гончарі, ковалі, пекарі та навіть кілька випускників Академії, які, здається, щось розповідають про зірки та астрономію всім охочим послухати. Тут дуже шумно і тісно від людей, діти грають у квача та хованки.
    
    Тобі постійно доводиться підійматись угору, що швидко виснажує і так стомлене тіло, від постійного крику починає боліти голова, а запах свіжого хліба нагадує, що настав час поїсти. Тому ти без вагань запитуєш у перехожого, де знаходиться трактир.
    """

    jump scene3