image day marker = Text(_("День 1"), size=120)

transform screen_center:
    xalign .5
    yalign .5


label scene5:
    scene bg black

    show day marker at screen_center with Dissolve(3)

    pause

    hide day marker with dissolve

    show bg laboratory night with fade

    "Ти прокидаєшся після глибокого сну. Голова болить так, що здається, її легше відрубати, аніж вилікувати."
    
    "Ти намагаєшся торкнутись лоба, але тобі щось заважає це зробити. Опустивши очі ти розумієш, що твої руки та ноги міцно прив’язані до медичного стільчика, який стоїть посеред кімнати."
    
    "Позаду щось шарудить, але ти не можеш сфокусуватись і подивитися, чи є хтось поруч із тобою."


    menu: 
        "Сидіти тихо і спробувати все роздивитись":
            "Ти обережно роздивляєшся приміщення з-під опущених вій. Поруч немає нічого, що могло би допомогти тобі звільнитись чи послати комусь запит про допомогу."

        "Спробувати звільнитись":
            "Ти прикладаєш немало сили, щоб розірвати шкіряні ремені, які утримують тебе на кріслі, проте вони досить міцні і всі твої зусилля виявляються марними."

        "Покликати на допомогу":
            GG "Агов? Тут є хтось?"
            GG "Допоможіть мені, будь ласка! Мене привели сюди обманом!"



    DT "О, хтось нарешті прокинувся?"


    show dottore at center

    DT "Як ніч? Що снилось?"

    GG "Що?"
    GG "Відпусти мене! Сталось якесь непорозуміння!"
    GG "Я не хочу тут бути!"

    DT "А? То я вчора помилився?"

    GG "Так!"
    
    DT "І елеазар ти вилікувати не хочеш?"

    GG "Хочу! Але… Чому мене прив’язали?"

    DT "Вчусь на своїх помилках. Всі щурики намагаються звідси втекти, коли дізнаються, чим ми тут будемо займатись."

    GG "Вони всі… Ти їх вбив?"

    DT "Ні. Я що, схожий на маніяка?"

    GG "…"


    DT "Отож."
    DT "Всі хочуть вилікуватись, але чомусь ніхто не хоче допомогти знайти ці ліки."
    DT "Люди думають, що всі знання і відкриття приходять до вчених уві сні чи під час читання книг. Що ніхто не перевіряє гіпотези, не ставить експерименти."
    DT "Тому доводиться іти на різні хитрощі, щоб отримати матеріали та піддослідних."
    DT "Тим паче що пошук лікування не дуже приємний процес."

    GG "…"
    GG "Розв’яжи мене."

    DT "Через кілька хвилин обов’язково розв’яжу."
    GG "Я не втікатиму."
    DT "Всі вони теж так казали."


    DT """
    Дивись, є два варіанти.
    
    Перший: ти будеш хорошим щуриком і допомагатимеш мені у дослідженні.
    
    Тоді я не витрачатиму сили на те, щоб тебе вкласти на місце, не буду користуватись заспокійливими, які можуть вплинути на кінцевий результат, і, можливо, навіть виділю тобі власне особисте місце в лабораторії на час перебування тут.
    
    Другий: ти будеш поганим щуриком, який всіляко буде заважати мені працювати. В цьому випадку я не гарантую тобі швидке повернення додому і емпатичне відношення під час неприємних процедур.
    
    Буду чесним – я не зацікавлений випускати тебе звідси, поки не перевірю кілька препаратів та теорій, над якими я працюю вже досить довгий час.
    
    Ну то як?
    """

    menu: 
        "Добре, я не опиратимусь":
            $ dotore_mood += -10
        "Промовчати":
            $ dotore_mood += 0
        "Ти гидкий покидьок і я не вірю жодному твоєму слову":
            $ dotore_mood += 10
    
    DT "Іншого я і не чекав."
    DT "Не рухайся."

    menu: 
        "Опиратись":
            $ dotore_mood += 10
            show bg laboratory night with Shake((0.5, 1.0, 0.5, 1.0), 4, dist=5)
            pause
            
            DT "Сиди спокійно."
            show bg laboratory night with Shake((0.5, 1.0, 0.5, 1.0), 1.5, dist=10)

            "Ляпас виявився неочікувано сильним. Поки ти намагаєшся сфокусувати погляд на вченому, він швидко робить укол у плече невідомою тобі речовиною"
            

            image half_black = Color((0, 0, 0, 150))

            with None
            window hide 
            show half_black 
            show ukol
            with fade

            pause
            window show
            
            

        
        "Нічого не робити":
            $ dotore_mood += -10


    "DEBUGG !!! dotore_mood: [dotore_mood]"
    "DEBUGG !!! dotore_mood: [dotore_mood]"
    "DEBUGG !!! dotore_mood: [dotore_mood]"
    "DEBUGG !!! dotore_mood: [dotore_mood]"