label scene11_1:
    call day(_("День 17"))

    scene bg laboratory
    show dottore
    with fade

    DT "Який же цей елеазар живучий! Його ліквідували разом з частинами тіла, а він почав рости на шиї і грудях."
    """
    Яка різниця, де він росте?
    """
    DT "Хм… Цікавий випадок."
    GG "Ти ненормальний!"
    DT "Мені вже це казали."
    GG "Відпусти мене. Хочу додому."
    DT smile 3 "Як же ти підеш додому, м-м-м?"

    menu:
        "ВІДПУСТИ!":
            $ False

    DT "Не кричи ти так."
    GG "НЕ ТОРКАЙСЯ МЕНЕ!"
    DT "Тиша в лабораторії!"
    """
    У тебе більше немає сил терпіти біль та знущання Дотторе.
    
    Це неможливо. Ніхто не може витримати те, що чверить цей покидьок.
    
    Архонти, чому він взагалі існує?
    """
    DT "Будемо експериментувати далі. Не все в житті вдається з першого разу."
    GG "НІ! ДОСИТЬ!"

    menu:
        "Закричати":
            play sound screem

    DT angry "Та замовкни ж ти!"

    if was_letter_send:
        call .with_letter
    else:
        call .without_letter

    if tried_to_escape_counter >= 2:
        jump .tried_to_escape
    else:
        jump .tried_to_rest




label .with_letter:
    DT "Сподіваюсь, твій брат буде себе вести набагато тихіше, аніж ти. Я не можу працювати в такій атмосфері!"
    GG "Брат?.."
    GG "Ні..."
    GG "Ти не можеш..."
    GG "Не чіпай його!"
    GG "Бо інакше я…"
    DT "І що ти зробиш?"
    return

label .without_letter:
    GG "Прибери свої руки від мене!"
    DT "Обов’язково. Тільки нас попереду чекає перевірка ще кількох гіпотез, тож готуйся."
    GG "…"
    GG "Я більше не можу."
    return

label .tried_to_escape:
    """
    Він не зупиниться. Не зупиниться доти, поки твоє і без того слабке дихання не зупиниться на його жахливій кушетці.
    
    Цей монстр робить з тобою все, що приходить в його збочений мозок.
    
    Сил терпіти ці катування більше нема.
    
    Потрібно щось зробити. Зламати всі його плани.
    
    …
    
    Дотторе як зазвичай відходить від тебе, щоб знайти потрібні йому медичні інструменти.
    
    Якщо щось робити, то зараз саме час.
    
    Зараз.
    """



    menu:
        "Сильно вкусити себе за язика":
            show blood 1:
                alpha 0.5
    """
    Знову біль.
    
    Твій друг останніх кількох… тижнів? Місяців? Років?
    """
    menu:
        "Сильно вкусити себе за язика":
            show blood 1:
                alpha 1
    """
    Ти відчуваєш металевий присмак крові, але цього все ще недостатньо.
    """
    menu:
        "Сильно вкусити себе за язика":
            hide blood 1
            show blood 2:
                alpha 0.5
    """
    Боляче так, що хочеться блювати.
    """
    menu:
        "Сильно вкусити себе за язика":
            show blood 2:
                alpha 1
    """
    Ти не маєш права навіть застогнати, щоб не привертати увагу цього покидька.
    """
    menu:
        "ВІДКУСИТИ ЯЗИКА":
            show blood 3:
                alpha 0.5
    """
    Кров ллється з твого рота на підборіддя, заляпуючи бинти на твоїх грудях та животі.
    """
    DT "Тобі цікаво, що я робитиму сьогодні?"
    """
    Вже нічого, тварюко.
    """
    menu:
        "ВІДКУСИТИ ЯЗИКА":
            show blood 3:
                alpha 1
    """
    Це виявляється важче, ніж тобі видавалось раніше.
    
    Краплі крові потрапляють тобі у горло, примушуючи закашлятись.
    """
    DT "Щурик сьогодні не в настрої розмовляти?"
    "Кров’ю залите все навколо. Хоча, можливо, так було і раніше?"
    show black:
        alpha 0.3
    #  Повільне згасання екрану, дууууууууууууууууууууууууууууже повільне, на кілька наступних діалогів
    DT "Гей? Що ти робиш?!"
    show black:
        alpha 0.6
    """
    Те, що потрібно було зробити у перший же день.
    """
    scene black with Dissolve(3)
    """
    Так добре.
    
    Нарешті.
    
    Свобода.
    """

    jump end


label .tried_to_rest:
    
    menu:
        "Засміятись":
            $ False

    DT "Ти чого?"
    
    menu:
        "Засміятись":
            $ False

    DT "…"
    """
    Ти перестаєш розуміти, де і з ким знаходишся.
    
    Це все нереально, не може бути реальним.
    
    В світі не повинно існувати таких, як Дотторе. Просто не може існувати.
    """
    menu:
        "Закричати":
            play sound screem

    DT "Де у мене лежить заспокійливе?"
    GG "Ненавиджу тебе!"
    """
    Відчуття нереальності наростає з кожною секундою. І чи не вперше воно рятує, а не лякає тебе.
    """
    GG "Чому я тут?"
    DT "Для лікування елеазару."
    menu:
        "Засміятись":
            $ False
    GG "Я не хворію."
    GG "…я..."
    GG "…де я..."
    DT "…"
    DT "І цей пацієнт не витримав."
    DT "Так і запишемо."
    GG "…я лікуюсь?.."
    GG "Чому?"
    DT "Втім, не важливо. Отже, сьогодні у нас за планом наступна схема…"
    menu:
        "Засміятись":
            $ False
    # TODO: Додати наркоманії на екран
    """
    Тобі все одно, хто ця людина і що вона робитиме.
    
    Тобі все одно, один він, чи таких псевдовчених багато.
    
    Тобі все одно, де ти.
    
    Тобі все одно, хто ти.
    
    Чорний екран
    
    Ти… хто ти?
    """
    GG "Хто я?"
    DT "Просто ще один мій пацієнт."



    jump end
