
label scene4_variant1:
    """
    Ти вирішуєш довіритись вченому і на під його наглядом пишеш невеликого листа брату, щоб той прибув у місто якомога швидше. 
    
    Ти залишаєш детальні інструкції, де можна буде знайти Дотторе, якщо по якійсь причині ти не зможеш його зустріти.
    
    Вчений навпроти тебе начебто нікуди не спішить, п’є чай і лише періодично вносить якісь уточнення в текст.
    """
    show dottore street hand 1

    DT "Готово? Дай мені, я закину його у поштову скриньку, а ти поки іди в Академію. Знайдеш там секретаря і попросиш заселити тебе у кімнату. Завтра зранку я зайду за тобою і ми почнемо лікування, якщо ти не передумаєш, звісно."

    show dottore street hand 2

    DT "А, ще згадав. Постарайся мінімально контактувати зі студентами та викладачами. Багато з них дуже упереджено ставляться до хворих елеазаром, тому не варто їх нервувати."

    """
    Ти киваєш головою і віддаєш листа вченому. Той прощається з тобою і наостанок детально розповідає, як дійти до Академії та де саме можна знайти секретаря.
    """

    show dottore street 1
    """
    
    Дотторе каже, що зайде по тебе завтра зранку і просить нікуди не йти, особливо в пошуках сніданку. Ти з усім погоджуєшся і виходиш з таверни слідом за лікарем.
    """

    scene bg city bazar dark
    with fade
    play music "sumery.wav"
    """
    Сонце вже почало сідати за горизонт. 
    
    Ти прощаєшся з Дотторе і спішиш піднятись по вказаній дорозі до Академії, щоб нарешті вирішити всі запитання та лягти спати раніше.
    """

    scene bg laboratory coridor

    GG "Нарешті я можу відпочити"

    """
    Ти без проблем заселяєшся у житло. Секретар не задавав зайвих запитань і після одного погляду на твої руки з лусочками без коментарів віддав ключі від кімнати.
    
    Що ж, цей день був довгим. Більшість вчених відпочиває, тож і ти вирішуєш готуватись до сну.
    """

    scene bg shower

    """
    Змиваючи пил та пісок зі шкіри, ти мимо волі думаєш про сім’ю, яка залишилась вдома.

    Цікаво, як швидко доставлять твого листа? Чи зможе мама привести брата у місто? А раптом у нього теж елеазар?

    Ти починаєш нервувати, але швидко заспокоюєш себе.

    Навряд чи брат також захворів, а якщо так, то лікар Дотторе зможе йому допомогти.

    Мабуть.

    Від води лусочки на тілі починають пекти ще більше і ти спішиш вимкнути воду та витерти тіло м’яким рушником.
    
    Тріщини на шкірі знову почали сочитися кров’ю.

    Потрібно лягати спати. Завтра точно буде краще.
    """

    scene bg laboratory coridor
    show half_black 

    GG "Що за…"

    """
    Ти точно пам’ятаєш, що десять хвилин тому світло у кімнаті було увімкнене.

    Ти нервово шукаєш перемикач, але в темряві не можеш намацати його.
    """

    GG "Спокійно. Все добре. Мабуть, воно вимикається само собою."

    "Так, ці розумні вчені точно зробили світло, що вимикається самостійно. Точно."

    "Боятися нема чого."

    GG "Та де ж ти?"

    GG """
    Га?

    Тут хтось є?
    """

    show dottore street shadow

    GG """
    
    …
    
    Хто тут?
    
    …
    
    Агов?
    
    Мабуть, у мене галюцинації…

    """
    pause
    pause


    show dottore street ukol

    DT "Вибач, не зміг чекати до ранку"

    GG "..."
    GG "...ні..."
    GG "НЕ ТРЕБА!"

    scene black
    pause
    

    jump scene5
