

label scene4_variant2:
    "Ти не хочеш писати листа. Зрештою, якби у брата чи мами був елеазар, це окрім тебе точно хтось помітив би."

    GG " Дякую, проте це не потрібно."

    DT "Діло твоє."

    "Дотторе уважно роздивляється твої руки, але більше нічого не каже. Ти стискаєшся і намагаєшся приховати лусочки під рукавами, проте тобі це не дуже вдається."


    DT "Я думаю, ми можемо вже сьогодні почати лікування. Пішли до мене в лабораторію, дам тобі першу дозу ліків, щоб не затягувати."

    "Ви допиваєте чай і покидаєте трактир."

    scene bg city bazar dark
    with  fade
    play music "№3_sumery.mp3" volume 2.0

    DT "Завжди бісило в цьому Сумеру те, що тут так рано темніє."

    GG "Хіба це рано?"

    DT "Так. На моїй батьківщині сонце встає о сьомій ранку і сідає о дев’ятій вечора."

    "Ви ідете по закрученим дорогам міста. Вулиці майже пусті, лише деінде стоять стражі порядку. Дотторе іноді кивком голови з кимось вітається, але іде мовчки, думаючи про своє."

    menu: 
        "Поговорити про лікування":
            GG "Як буде проходити лікування? В сенсі, це пігулки, чи мазі якісь?"
            DT "Трошки того, трошки іншого. Потім розповім, бо в цих вулиць є дуже цікаві вуха, які дуже хочуть внести своє ім’я в підручники, але не бажають навіть пальцем ворухнути для цього."
        "Спитати про дослідження":
            GG "Як довго ти цим займаєшся? Чому так довго ніхто не міг знайти ліки від елеазару?"
            DT "Близько десяти років, але цікавився темою з дитинства. Елеазар важко досліджувати, адже мало хто погоджується стати піддослідним кроликом, щоб допомогти лікарям знайти чарівну пігулку від хвороби."
            GG "..."
            GG "Мені не подобається порівняння з кроликом."
            DT smile "Нікому не подобається."

    DT "Майже на місці."



    """
    Сонце зовсім зайшло за горизонт і стало набагато прохолодніше. Ти кутаєшся в дорожній плащ та непомітно для вченого позіхаєш, прикривши рота долонею. Довго дорога сильно втомила тебе, а ситна вечеря – в кінець розморила.

    Здається, ви з Дотторе вже вийшли за місто. Навколо немає ні будинків, ні людей, ні вуличних тварин, тільки голосніше співають цвіркуни.
    
    Ти починаєш нервуватись і думаєш, чи не варто тобі повернути назад. Адже ще не пізно звернутись в Академію чи пошукати хостел на цю ніч.

    """

    DT "Ось і прийшли."

    scene bg house

    GG """

    Ого!
    """

    "Дотторе відчиняє масивні ворота і ви разом заходите у двір невеликого будинку, який сховався у високих густих сумерських заростях."
    
    "Вчений відступає вбік і галантно пропускає тебе у будинок."

    
    
    scene bg black
    window hide
    stop music fadeout 1.0
    with fade

    play sound "<from 0 to 8>skrep.wav"

    pause 8

    show bg laboratory coridor
    with fade

    play sound "<from 0 to 3>angry-door-entrance-lock-unlock-a.mp3" fadeout 0.5

    pause 3
    
    window auto

    play music "horror-coridor.wav" fadein 3.0

    """
    Ви разом заходите всередину і Дотторе відразу зачиняє двері на ключ.
    """

    DT "Щоб ніхто з колег не забажав підгледіти результати моєї роботи."

    GG "…"
    GG "Гм..."
    GG "...цікаві у вас колеги..."
    GG "А чому тут так темно?"

    """

    ...і моторошно...
    """
    GG "Пане лікарю?"

    menu: 
        "Агов?":
            $ False
        "Можна увімкнути світло?":
            $ False

    DT "Зліва від тебе сходи вниз. Спускайся, там є світло."

    GG "Ем…"

    jump .what_to_do
                

label .what_to_do(can_go_back=True):
    menu:
        "Спуститись":
            jump scene4_variant2_basement
        "Повернути назад" if can_go_back:
            "Ти робиш крок назад, але натикаєшся на Дотторе, який стоїть відразу за тобою."
            DT "Чого ти? Іди вперед."
            "Тобі нічого не залишається як підкоритись."
            call .what_to_do(False)
    return

label scene4_variant2_basement:

    scene bg black

    "Ти обережно ступаєш по сходах у темряві. Схоже, це якесь підвальне приміщення, ти із вченим без перешкод опиняєшся внизу."
    stop music
    
    play  sound "404505__wly__unlock-door-mono.mp3"

    GG """

    Що?

    Гей! Не потрібно мене зачиняти!

    А?..
    """

    GG "Що відбувається?"


    scene bg laboratory entrance
    with fade
    play music "laboratory hello.mp3"

    GG "..."

    GG "Де я?"

    show dottore street 2

    DT "А на що схоже?"

    GG "..."
    show dottore street 4
    DT "Будемо лікуватись?"
    GG "…"
    GG "Ні."
    DT "В будь-якому разі вже темно, повертатись назад пізно."
    DT "Кажуть, у місті люди ночами…"

    show dottore street 2
    extend "пропадають…"


    camera:
        blur 0
        linear 2.0 blur 20
        linear 1.0 blur 0
        repeat

    "У тебе починає крутитись голова. Ноги терпнуть, руки трясуться настільки, що ти навіть не можеш схопитись за невеликий ніж на поясі, яким ти зазвичай користуєшся у походах."

    

    DT "Хороший чай, правда? Головне правильно розрахувати час."

    GG "Я… мене шукатимуть."

    DT "Хай шукають."
    DT "Можливо, навіть знайдуть. Я не проти."

    camera:
        blur 10
        linear 2.0 blur 40

    DT "А тепер пора спати."

    scene black with fade
    pause

    DT "Нас чекає цікаве дослідження."

    camera

    jump scene5
