init:

    python:
    
        import math

        class Shaker(object):
        
            anchors = {
                'top' : 0.0,
                'center' : 0.5,
                'bottom' : 1.0,
                'left' : 0.0,
                'right' : 1.0,
                }
        
            def __init__(self, start, child, dist):
                if start is None:
                    start = child.get_placement()
                #
                self.start = [ self.anchors.get(i, i) for i in start ]  # central position
                self.dist = dist    # maximum distance, in pixels, from the starting point
                self.child = child
                
            def __call__(self, t, sizes):
                # Float to integer... turns floating point numbers to
                # integers.                
                def fti(x, r):
                    if x is None:
                        x = 0
                    if isinstance(x, float):
                        return int(x * r)
                    else:
                        return x

                xpos, ypos, xanchor, yanchor = [ fti(a, b) for a, b in zip(self.start, sizes) ]

                xpos = xpos - xanchor
                ypos = ypos - yanchor
                
                nx = xpos + (1.0-t) * self.dist * (renpy.random.random()*2-1)
                ny = ypos + (1.0-t) * self.dist * (renpy.random.random()*2-1)

                return (int(nx), int(ny), 0, 0)
        
        def _Shake(start, time, child=None, dist=100.0, **properties):

            move = Shaker(start, child, dist=dist)
        
            return renpy.display.layout.Motion(move, time, child, add_sizes=True, **properties)

        Shake = renpy.curry(_Shake)
    #

#

label scene8_1:

    call day(_("День 5"))

    play music "day-1.mp3"
    scene bg laboratory with dissolve
    show dottore lab angry with dissolve
    
    GG "…"
    DT "Теорія виявилась невірною. Він знову з’являється."
    """
    Дотторе з прикрістю розглядає нові лусочки елеазара, які почали проростати на покритих твердою кірочкою поверхнях рук та ніг.
    
    Ти тамуєш подих і дивишся за кожним його рухом. Звільнені від бинтів кінцівки болять і печуть, але ти боїшся видати хоча б звук.
    """
    show dottore lab angry 2
    DT """
    Як же так…
    
    Зараз не можу це перевірити, але мені здається, що вони стали ще більш грубими, ніж до операції. Як гадаєш?
    """
    GG "…"
    show dottore lab smile 4
    DT """
    
    Конструктивно.
    
    Добре, потрібно продовжувати роботу. Сподіваюсь, тобі сьогодні добре спалось, бо для подальшого лікування обов’язково потрібно, щоб пацієнт почував себе нормально і був у доброму гуморі.
    
    Крім того, наступний етап займе у нас набагато більше часу, тому можемо сьогодні пропрацювати до ночі. Зважай на це.
    """
    show dottore lab smile 6
    GG "…"
    GG "Чому?"
    DT "Тому що операція – це складно. До того ж я ні разу нічого подібного ще не робив"
    GG "Ем… Яка ще операція?"

    window hide
    with None
    show half_black 
    show instruments
    with dissolve
    play sound "metal instr.mp3"
    pause
    with dissolve
    stop music
    

    """
    Дотторе починає викладати поруч із собою на столик медичні інструменти. 
    
    Ти спостерігаєш, як він дістає довгі металеві пінцети, шприци великого об’єму, якісь темні нитки, намотані на котушку, щось схоже на клаптики тканини, колби з рідинами та закручені на кінцях голки.
    
    Стає моторошно.
    """

    play music "laboratory hello.mp3"

    DT """
    Знаєш, що цікаво? Я багато часу провів за дослідженням елеазару і зрозумів, що досі нема жодного зафіксованого випадку зараження ним тваринами та птахами.
    
    Чому люди ним заражаються, а тварини – ні? Від чого це залежить?
    """
    
    hide instruments 
    hide half_black
    with dissolve

    window auto

    show dottore lab smile 4
    DT """
    Я вже пробував переливати кров від тварини пацієнту, але той щось дуже швидко помер. Не знаю, це сталось через кров собаки в його судинах чи тому що він після цього два дні провів у морозильній камері.
    
    Не впевнений до кінця.
    
    Чи хворіють оті гібриди людей і тварин? Жодного такого не бачив.
    
    Чи можемо ми штучно зробити гібрида? Не знаю, треба експериментувати.
    """

    show dottore lab smile 6
    DT """    
    Наразі хочу спробувати пересадити тобі шкіру в’ючного яка і подивитись, чи виросте елеазар на ній.
    
    Як тобі ідея?
    """
    GG "…"
    show dottore lab smile 10
    GG "Ти абсолютно хворий! Відпусти мене!"
    show dottore lab smile 4
    DT "Ні, сонце, хвора тут тільки одна людина - ти. Я ж намагаюсь тебе вилікувати."
    GG "Це теж не подіє! Ні в якому всесвіті твої ідеї не спрацюють!"
    DT "Побачимо. За кілька хвилин починаю, налаштовуйся."
    GG "Я не хочу!"
    DT "Я теж не хочу працювати у свій вихідний, але ж хтось повинен це робити."
    GG "Ні! Це не нормально! Мені боляче!"
    show dottore lab smile 9
    DT "Лікуватись боляче, що ж поробиш."
    GG "Ти не лікар! Лікарі не калічать!"

    "Дотторе лише усміхається і більше не вступає у діалог."

    "Він просякає ганчірку рідиною з якоїсь пляшечки без підпису і відразу прикладає її до оголених ран на нозі"

    GG "Ай!"
    show dottore lab tweezers 2
    
    DT "Потерпи, треба розмочити поверхню, щоб шкіра добре прижилась."


    menu:
        "Сіпнутись":
            show bg laboratory with Shake((0.5, 1.0, 0.5, 1.0), 1.5, dist=10)
            "Ти сіпаєш ногою з такою силою, що Дотторе здригається від легкого переляку, але роботу не перериває."
            "Лише поглядом ковзає по шкіряним ременям, які утримують тебе."

        "Закричати":
            show dottore lab angry 2
            DT "Тихо ти. Заважаєш."
            
    show dottore lab smile 9
    """
    Вчений протирає твої руки і ноги не звертаючи уваги на зойки та коментарі. Частина ран починає сочитися кров’ю, але то і не дивно, зважаючи на те, з якою силою Дотторе відривав бинти від тіла кілька хвилин тому.

    Він обробляє голку спиртом, заправляє нитку та щипцями дістає заготований клаптик шкіри яка з жовтуватої рідини, у якій той плавав весь цей час.

    Ти з власного досвіду знаєш, що шкіра яка досить груба, адже у природі їй потрібно витримувати напади хижаків. Навряд вона приживеться, та і чи можливо це взагалі?

    """
    show dottore lab tweezers 2
    window hide
    with None
    show half_black 
    show hands operation
    with dissolve
    pause
    
    "Дотторе притискає клапоть шкіри до твоєї гомілки і робить перший укол голкою."

    camera:
        blur 0
        linear 0.5 blur 30
        linear 1.0 blur 0

    GG "Ай! Боляче!"
    DT "Угу. Терпи."
    """
    Голка погано входить у тканини, застрягаючи в твоєму тілі.
    
    Біль просто пекельний.
    """

    menu:
        "Закричати":
            pass

    scene bg black
    show hands operation
    with dissolve

    "Нитка безкінечно довго тягнеться крізь м’язи та нерви, пронизує судини"

    "Перший кривий стібок зроблений."

    camera:
    scene bg black
    show hands operation
    with fade

    "Другий кривий стібок знову починається з болючого укусу голкою в оголений закривавлений епітелій."

    menu:
        "Закричати":
            play sound screem
            pause 3
            DT "Тихіше ти. Заважаєш."

    """
    Укол голкою.
    """

    camera:
        blur 0
        linear 0.5 blur 30
        linear 1.0 blur 0

    camera:
    scene bg black
    show hands operation 2
    with fade

    """
    Нитка.
    
    Пінцет.
    
    Вузлик.
    """

    menu:
        "Закричати":
        
            DT "Циц!"

    camera:
        blur 0
        linear 0.5 blur 30
        linear 1.0 blur 0
    """
    Укол.

    Нитка.

    Пінцет.
    """

    camera:
        blur 0
        linear 0.5 blur 30
        linear 1.0 blur 0

    """
    Вузлик.

    Укол…
    """

    scene black with dissolve

    menu:
        "Закричати":
            play sound screem
            pause 5

    jump scene8_1_night


label scene8_1_night:

    stop music
    scene black

    """
    …
    
    …
    
    …
    """
    
    DT "…операція пройшла успішно…"
    
    "…"
    
    DT "…період реабілітації…"

    menu:
        "Відкрити очі":
            $ False

    "…"

    menu:
        "Відкрити очі":
            $ False

    scene bg laboratory night
    show dottore lab smile 9
    with openeyes
    play music "in the night.mp3"

    DT "О, хто тут у нас прокинувся!"

    """
    Ти хочеш закрити очі і знову провалитись у ту спокійну тиху темряву, де немає болю та цього безумного вченого у масці.
    
    Руки та ноги болять так сильно, що хочеться відділити їх від тіла назавжди.
    """
    show dottore lab smile 4
    DT "Поки ти спиш, я встиг поприбирати операційну, повечеряти та написати звіт. Як ти себе почуваєш?"

    menu:
        "Краще не буває":
            $ False
        "Болить":
            $ False
        "Дуже погано":
            $ False

    DT "Так і запишу. Голова не крутиться? Нудить? Хочеш пити? Їсти? Спати?"
    show dottore lab smile 6


    """
    Ти зітхаєш. Якщо чесно – все і одночасно, але говорити нема сил.
    
    Пришита шкіра відчувається чужорідною, огрубілою. Гидко.

    """
    play sound "metal.mp3"
    """
    Ти хочеш перевернутись на інший бік, щоб не бачити Дотторе, але традиційно пристебнуті кайданки не дають тобі це зробити.
    
    Нічого нового.
    """
    show dottore lab smile 1
    DT "Твоя їжа поруч. Завтра прийду перевірити, як ти тут, а поки відпочивай і набирайся сил."

    hide dottore with dissolve
    play sound "<from 15 to 16>skrep.wav" volume 1 
    play sound "key2.mp3" volume 1 

    "Дотторе йде, зачинаючи двері у лабораторію на ключ."

    "Ти сідаєш вище і оглядаєш результат роботи вченого. Жахливо."

    window hide
    with None
    show half_black 
    show hands operation after
    with dissolve
    pause

    """
    Клаптики чужорідної шкіри пришиті досить неакуратно, з-під них постійно сочиться кров та інші рідини.
    
    І біль. Все болить.
    
    Ти зітхаєш. Що робити далі?
    """

    menu: 
        "Поїсти та відпочити":
            $ False
        "Спробувати звільнитись":
            $ tried_to_escape_counter += 1
            play sound "metal.mp3"
            """
            Ти сідаєш зручніше і роздивляєшся кайданки, якими Дотторе прикував тебе до труби.
            
            Здається, сьогодні вчений залишив більше вільного простору для руки ніж зазвичай, тому ти намагаєшся обережно вислизнути зі сталевих лещат.
            """

    hide hands operation after with dissolve
    "Ти їси холодний прісний суп, який залишив тобі вчений. Що ж, це краще, ніж нічого."
    "Відставивши тарілку ти вкладаєшся на брудному матраці і провалюєшся у тривожний неглибокий сон."

    jump scene9_1