label scene8_2:
    
    call day(_("День 5"))

    call .show_laboratory

    DT "Ану, відкрий рота."
    """
    Ти намагаєшся зручніше влягтися на холодній кушетці, але, як зазвичай, не вдається. Шкіряні ремені тримають міцно і не дають змінити положення, тож доводиться радіти тому, що є.

    Пропозиція оглянути рота не виявилась несподіванкою для тебе: Дотторе тримає в руках довгий металевий шпатель, яким він з великим ентузіазмом лізе всередину, не чекаючи твоїх заперечень.
    """
    DT "Цікаво. Зуби у тебе і раніше так хиталися, чи це дія препарату?"
    """
    Ти легким кивком підтверджуєш, що це дійсно дія останньої розробки вченого. Навіть трохи лячно, що вона і справді працює.
    """
    DT "Дивно, що лусочки все одно продовжують рости, навіть нові з’являються, ось, поглянь."
    DT "Хм..."
    DT "..."
    DT "Зараз дещо спробуємо."
    """
    Вчений відвертається і починає щось шукати у своєму робочому столі.
    """

    scene bg black
    show instruments
    with fade


    "Дотторе починає викладати поруч із собою на столик медичні інструменти. Ти спостерігаєш, як він дістає довгі металеві пінцети, шприци великого об’єму, якісь темні нитки, намотані на котушку, щось схоже на клаптики тканини, колби з рідинами та закручені на кінцях голки."
    
    GG "…"
    
    call .show_laboratory


    """
    Коли Дотторе завершує всі приготування, ти починаєш тремтіти.
    """
    GG "Що ти робитимеш?"
    DT "О, це буде цікаво."
    DT "Слухай."
    DT "Я ось що помітив: не дивлячись на виведення кальцію, елеазар продовжує рости. Впевнений, якщо його прибрати, доки він такий «ослаблений», то він знову не з’явиться."


    DT "Розумієш?"
    DT "Тому зараз будемо займатись прибиранням лусочок. Довго, боляче, але все має вийти як треба."
    GG "…"
    GG "Боляче?"
    DT "Так. Будь-яка операція це боляче. Ти ж хочеш вилікуватись?"
    GG "Хочу, але… але не так."
    DT "Ніхто не любить лікуватись."


    menu:
        "Ти хворий покидьок! Це не подіє в жодному з існуючих Всесвітів!":
            $ dotore_mad =+ 10
            GG "Ти абсолютно хворий! Відпусти мене!"
            DT "Ні, сонце, хвора тут тільки одна людина - ти. Я ж намагаюсь тебе вилікувати."
            GG "Це теж не подіє!"
            DT "Побачимо. За кілька хвилин починаю, налаштовуйся."
            GG "Я не хочу!"
            DT "Я теж не хочу працювати у свій вихідний, але ж хтось повинен це робити."
            GG "Ти не лікар! Лікарі не калічать!"
            DT """
            Ну-ну, тихіше. Це ж для твого блага.

            Я не бажаю тобі зла, я хочу лише знайти ліки від елеазару.
            """
        "Промовчати":
            $ dotore_mad =+ -10
        "Почати вовтузитись":
            $ dotore_mad =+ 5
            DT """
            Ну-ну, тихіше. Це ж для твого блага.

            Я не бажаю тобі зла, я хочу лише знайти ліки від елеазару.
            """

    DT """
    Добре, щось я відволікся, а роботу починати потрібно. Сподіваюсь, тобі сьогодні добре спалось, бо для подальшого лікування обов’язково потрібно, щоб пацієнт почував себе нормально і був у доброму гуморі.

    Крім того, наступний етап займе у нас набагато більше часу, тому можемо сьогодні пропрацювати до ночі. Зважай на це.
    """

    python:
        renpy.input(_("Що скажеш?"))

    """
    Дотторе лише усміхається і більше не вступає у діалог.

    Дотторе з пінцетом. Він бере зі столику довгий металевий пінцет і нахиляється над твоєю лівою ногою.
    """

    DT "Почнемо звідси."

    scene bg black
    show operation tweezers
    with fade

    "Вчений пінцетом підчеплює одну з твердих лусочок і різко смикає на себе, але та не піддається"

    call .show_laboratory
    
    GG "Ай! Боляче!"
    DT "Тихо!"
    """
    Дотторе знову перехоплює лусочку і смикає на себе. Додати якийсь ефект типу боляче.
    """

    call action_screem

    DT "Ти мені заважаєш. Все, я її зняв з тебе, заспокойся."
    """
    Вчений викидає лусочку у порожній контейнер і знову нахиляються над тобою.
    """
    GG "Зупинись! Досить!"
    DT "…"
    GG "Це не спрацює!"

    scene bg black
    show operation tweezers 2
    with fade

    call action_screem
    GG "Все! Перестань!"

    camera:
        blur 5

    """
    Очі проти твоєї волі заповнюються сльозами.
    """

    """
    Дідько, як же боляче.
    
    …
    
    Знову пінцет.
    """
    DT "Ще одна."

    show blood 1

    GG "Ай!"
    """
    Я не витримаю.
    """

    menu:
        "Лаяти Дотторе":
            $ dotore_mad += +10
        "Зціпити зуби":
            $ dotore_mad += -10

    DT "Як вона вчепилась за тебе, ніяк не хоче від’єднуватись."

    """
    По нозі починає текти цівочка крові.
    
    Тебе починає нудити від болю.
    """
    DT "Ще одна."
    DT "І ще."
    DT "І ще."
    GG "…мені погано…"
    DT "Терпи."
    """
    Перша.
    
    Третя.
    
    Десята.
    
    …
    
    …сота…
    """

    call action_screem

    GG "…зупинись…"
    GG "…я…"
    GG "…я більше не можу…"

    scene bg black with dissolve

    """
    …
    
    …так добре…
    
    …хай це все виявиться сном…
    
    …жахливим, химерним сном…
    
    …
    
    …так тихо…
    """
    DT "Гей!"
    DT "Прокидайся!"
    DT "Аго-о-ов!"

    camera
    scene bg laboratory
    show dottore tweezers
    with Dissolve(3)

    """
    Ти повільно відкриваєш очі.
    
    …
    
    Це не сон.
    """
    GG "…пити…"
    DT "Поп’єш через годинку."
    DT "Я закінчив перший етап операції."
    """
    Ти обережно підіймаєш голову і розглядаєш своє тіло.
    """
    GG "…"
    GG "…який жах…"
    """
    Твоє тіло схоже на одну велику криваву рану.
    
    Ноги та руки покриті тонкою кірочкою запеклої крові, яка виступала під час «операції».
    
    Де-не-де видніються уламки елеазару, які вчений не зміг дістати пінцетом.
    """
    DT "Нічого, буде гарніше."
    DT "А зараз закріпимо результат."
    
    hide dottore with fade
    
    """
    Дотторе відвертається від тебе і йде кудись вглиб лабораторії.
    """
    """
    Ти важко зітхаєш. Невже кінець і тебе нарешті залишать у спокої?
    """
    DT "Зараз буде боляче, тож потерпи трішки."

    show dottore

    GG "…"
    GG "НІ!"

    show dottore smile

    """
    Дотторе опускає залізний прутень і притискає його до твоєї руки.
    """

    call action_screem(_('ЗАКРИЧАТИ'))

    DT "Тихіше."
    call action_screem(_('ЗАКРИЧАТИ'))
    DT "Ох ці невдячні пацієнти."
    GG "…кх…"

    scene bg black with Dissolve(2)

    jump scene9_2


label .show_laboratory:
    scene bg laboratory
    show dottore
    with fade
    return

label action_screem(text=_("Закричати")):
    menu:
        '[text]':
            play sound screem
    return