label scene8_2:
    
    call day(_("День 5"))
    play music "day-1.mp3"
    show bg laboratory
    with dissolve

    show dottore lab smile 4
    with dissolve

    DT "Ану, відкрий рота."
    """
    Ти намагаєшся зручніше влягтися на холодній кушетці, але, як зазвичай, не вдається. Шкіряні ремені тримають міцно і не дають змінити положення, тож доводиться радіти тому, що є.

    Пропозиція оглянути рота не виявилась несподіванкою для тебе: Дотторе тримає в руках довгий металевий шпатель, яким він з великим ентузіазмом лізе всередину, не чекаючи твоїх заперечень.
    """
    DT "Цікаво. Зуби у тебе і раніше так хиталися, чи це дія препарату?"

    show dottore lab

    """
    Ти легким кивком підтверджуєш, що це дійсно дія останньої розробки вченого. Навіть трохи лячно, що вона і справді працює.
    """
    DT "Дивно, що лусочки все одно продовжують рости, навіть нові з’являються, ось, поглянь."
    DT "Хм..."
    show dottore lab smile 1
    DT "..."
    DT "Зараз дещо спробуємо."
    show dottore lab smile 10
    """
    Вчений відвертається і починає щось шукати у своєму робочому столі.
    """

    window hide
    with None
    show half_black 
    show instruments
    with fade
    pause

    "Дотторе починає викладати поруч із собою на столик медичні інструменти."
    
    "Ти спостерігаєш, як він дістає довгі металеві пінцети, шприци, якісь темні нитки, намотані на котушку, клаптики тканини, колби з рідинами та закручені на кінцях голки."
    
    GG "…"

    hide half_black 
    hide instruments
    with fade
    show bg laboratory
    show dottore lab smile 1

    show dottore lab smile 8
    """
    Коли Дотторе завершує всі приготування, ти починаєш тремтіти.
    """
    GG "Що ти робитимеш?"
    show dottore lab smile 10
    DT "О, це буде цікаво."
    DT "Слухай."
    show dottore lab smile 5
    DT "Я ось що помітив: не дивлячись на виведення кальцію, елеазар продовжує рости. Впевнений, якщо його прибрати, доки він такий «ослаблений», то він знову не з’явиться."

    show dottore lab smile 4
    DT "Розумієш?"
    DT "Тому зараз будемо займатись прибиранням лусочок. Довго, боляче, але все має вийти як треба."
    GG "…"
    GG "Боляче?"
    show dottore lab smile 6
    DT "Так. Будь-яка операція це боляче. Ти ж хочеш вилікуватись?"
    GG "Хочу, але… але не так."
    DT "Ніхто не любить лікуватись."


    menu:
        "Ти хворий покидьок! Це не подіє в жодному з існуючих Всесвітів!":
            $ dotore_mad =+ 10
            GG "Ти абсолютно хворий! Відпусти мене!"
            show dottore lab smile 3
            DT "Ні, сонце, хвора тут тільки одна людина - ти. Я ж намагаюсь тебе вилікувати."
            GG "Це теж не подіє!"
            DT "Побачимо. За кілька хвилин починаю, налаштовуйся."
            show dottore lab
            GG "Я не хочу!"
            DT "Я теж не хочу працювати у свій вихідний, але ж хтось повинен це робити."
            GG "Ти не лікар! Лікарі не калічать!"
            DT """
            Ну-ну, тихіше. Це ж для твого блага.

            Я не бажаю тобі зла, я хочу лише знайти ліки від елеазару.
            """
        "Промовчати":
            $ dotore_mad =+ -10
        "Почати вовтузитись":
            $ dotore_mad =+ 5
            DT """
            Ну-ну, тихіше. Це ж для твого блага.

            Я не бажаю тобі зла, я хочу лише знайти ліки від елеазару.
            """

    show dottore lab smile 8
    DT """
    Добре, щось я відволікся, а роботу починати потрібно. Сподіваюсь, тобі сьогодні добре спалось, бо для подальшого лікування обов’язково потрібно, щоб пацієнт почував себе нормально і був у доброму гуморі.

    Крім того, наступний етап займе у нас набагато більше часу, тому можемо сьогодні пропрацювати до ночі. Зважай на це.
    """

    python:
        renpy.input(_("Що скажеш?"))

    show dottore lab tweezers
    """
    Дотторе лише усміхається і більше не вступає у діалог.

    Дотторе з пінцетом. Він бере зі столику довгий металевий пінцет і нахиляється над твоєю лівою ногою.
    """

    DT "Почнемо звідси."

    show black 
    show operation tweezers
    with fade

    "Вчений пінцетом підчеплює одну з твердих лусочок і різко смикає її на себе."
    play sound "bones crunching.wav"

    camera:
        blur 0
        linear 1.0 blur 30
        linear 0.5 blur 0
    
    GG "Ай! Боляче!"
    DT "Тихо!"
    """
    Дотторе перехоплює лусочку і знову смикає її.
    """

    call action_screem

    DT "Ти мені заважаєш. Все, я її зняв з тебе, заспокойся."
    """
    Вчений викидає лусочку у порожній контейнер і знову нахиляються над тобою.
    """
    GG "Зупинись! Досить!"
    DT "…"
    GG "Це не спрацює!"

    play sound "bones churching.mp3"
    scene bg black
    show operation tweezers 2
    with fade

    call action_screem
    GG "Все! Перестань!"

    camera:
        blur 5

    """
    Очі проти твоєї волі заповнюються сльозами.
    """

    camera:
        blur 0
        linear 1.0 blur 30
        linear 0.5 blur 0

    """
    Дідько, як же боляче.
    
    …
    
    Знову пінцет.
    """
    DT "Ще одна."
    play sound "bones churching.mp3"

    show blood 1

    GG "Ай!"
    """
    Я не витримаю.
    """

    menu:
        "Лаяти Дотторе":
            $ dotore_mad += +10
        "Зціпити зуби":
            $ dotore_mad += -10

    DT "Як вона вчепилась за тебе, ніяк не хоче від’єднуватись."

    play sound "bones churching.mp3"

    camera:
        blur 0
        linear 1.0 blur 30
        linear 0.5 blur 0

    """
    По нозі починає текти цівочка крові.
    
    Тебе починає нудити від болю.
    """
    DT "Ще одна."

    camera:
        blur 0
        linear 1.0 blur 30
        linear 0.5 blur 0

    play sound "bones churching.mp3"
    DT "І ще."
    DT "І ще."
    GG "…мені погано…"

    camera:
        blur 0
        linear 1.0 blur 30
        linear 0.5 blur 0

    DT "Терпи."

    play sound "bones churching.mp3"
    """
    Перша.
    """
    play sound "bones churching.mp3"
    """
    Третя.
    
    Десята.
    
    …
    """
    play sound "bones churching.mp3"
    """
    …сота…
    """

    camera:
        blur 0
        linear 1.0 blur 30
        linear 0.5 blur 0

    call action_screem

    GG "…зупинись…"
    GG "…я…"
    GG "…я більше не можу…"

    scene bg black with dissolve
    stop music
    """
    …
    
    …так добре…
    
    …хай це все виявиться сном…
    
    …жахливим, химерним сном…
    
    …
    
    …так тихо…
    """
    DT "Гей!"
    DT "Прокидайся!"
    DT "Аго-о-ов!"

    camera
    scene bg laboratory
    show dottore lab tweezers 2
    with Dissolve(3)
    play music "laboratory hello.mp3"

    """
    Ти повільно відкриваєш очі.
    
    …
    
    Це не сон.
    """
    show dottore lab smile 8
    GG "…пити…"
    DT "Поп’єш через годинку."
    DT "Я закінчив перший етап операції."
    """
    Ти обережно підіймаєш голову і розглядаєш своє тіло.
    """
    GG "…"
    GG "…який жах…"
    """
    Твоє тіло схоже на одну велику криваву рану.
    
    Ноги та руки покриті тонкою кірочкою запеклої крові, яка виступала під час «операції».
    
    Де-не-де видніються уламки елеазару, які вчений не зміг дістати пінцетом.
    """
    DT "Нічого, буде гарніше."
    DT "А зараз закріпимо результат."
    
    hide dottore with fade
    
    """
    Дотторе відвертається від тебе і йде кудись вглиб лабораторії.
    """
    """
    Ти важко зітхаєш. Невже кінець і тебе нарешті залишать у спокої?
    """
    DT "Зараз буде боляче, тож потерпи трішки."

    show dottore lab fire

    GG "…"
    GG "НІ!"

    """
    Дотторе опускає руку і проводить вогнем вздовж твоїх ран.
    """

    call action_screem(_('ЗАКРИЧАТИ'))

    DT "Тихіше."
    call action_screem(_('ЗАКРИЧАТИ'))
    DT "Ох ці невдячні пацієнти."
    GG "…кх…"

    scene bg black with Dissolve(2)

    jump scene9_2


label .show_laboratory:
    scene bg laboratory
    show dottore
    with fade
    return

label action_screem(text=_("Закричати")):
    menu:
        '[text]':
            play sound screem
    return