label scene8_2:
    
    call day(_("День 5"))

    scene bg laboratory
    show dottore
    with fade

    DT "Ану, відкрий рота."
    """
    Ти намагаєшся зручніше влягтися на холодній кушетці, але, як зазвичай, не вдається. Шкіряні ремені тримають міцно і не дають змінити положення, тож доводиться радіти тому, що є.

    Пропозиція оглянути рота не виявилась несподіванкою для тебе: Дотторе тримає в руках довгий металевий шпатель, яким він з великим ентузіазмом лізе всередину, не чекаючи твоїх заперечень.
    """
    DT "Цікаво. Зуби у тебе і раніше так хиталися, чи це дія препарату?"
    """
    Ти легким кивком підтверджуєш, що це дійсно дія останньої розробки вченого. Навіть трохи лячно, що вона і справді працює.
    """
    DT "Дивно, що лусочки все одно продовжують рости, навіть нові з’являються, ось, поглянь."
    DT "Хм..."
    DT "..."
    DT "Зараз дещо спробуємо."
    """
    Вчений відвертається і починає щось шукати у своєму робочому столі.
    """

    scene bg black
    show instruments
    with fade

    jump scene9_2